    {  
"speakers":[  
  {  
     "description":"Programowanie to moja pasja. Podczas swojej kariery zawodowej uczestniczyłem w pracy nad zarówno projektami zakończonymi sukcesem, jak i będącymi totalną porażką. Większość tego co wiem, nauczyłem się z tych drugich.\n\nMocno wierzę w manifest Software Craftsmanship. M.in. z tego powodu organizuję Boiling Frogs oraz założyłem firmę Tratif — software house, w którym jakość kodu jest zawsze na pierwszym miejscu (więcej na http://tratif.com).\n\nCzasami piszę na firmowym blogu (http://blog.tratif.com). Praktykuję Test Driven Development i godzinami mogę rozmawiać o testach automatycznych i ich czytelności.\n\nW pracy używam głównie Javy, ale nie lubię określenia “programista Javy”. Uważam się po prostu za “programistę”, a technologia jest dla mnie jedynie narzędziem. Zawsze należy dobierać narzędzia do specyfiki danego problemu.\n\nLubię wierzyć, że oprogramowaniem można zmieniać świat.",
     "id":1,
     "linkedin":"https://www.linkedin.com/in/tkaczmarzyk",
     "name":"Tomasz Kaczmarzyk",
     "occupation":"Co-founder at Tratif",
     "photoUrl":"https://2020.boilingfrogs.pl/wp-content/uploads/2019/09/avatar-300x300.jpeg",
     "twitter":"https://twitter.com/tkaczmarzyk"
  },
  {  
     "description":"Software architect interesujący się złożonymi systemami o wysokiej wartości biznesowej, związany głównie z platformami webowymi. Ex-CTO, konsultant, speaker i trener w Bottega IT Minds. Z branżą IT związany od ponad 18 lat. Od kilku lat wykorzystuje EventStorming jako narzędzie do komunikacji pomiędzy zespołami developerskimi i biznesowymi, a także do modelowania oprogramowania w oparciu o DDD, CQRS czy EventSourcing. Uczestnik EventStorming Summit 2017, gdzie wspólnie z innymi zaproszonymi przez Alberto Brandoliniego osobami pracował nad rozwojem tej techniki. Po godzinach oddaje się swoim innym pasjom, fotografii i gitarze elektrycznej.",
     "id":2,
     "linkedin":"https://www.linkedin.com/in/mariuszgil/",
     "name":"Mariusz Gil",
     "occupation":"Software architect",
     "photoUrl":"https://2020.boilingfrogs.pl/wp-content/uploads/2020/02/gil-300x300-1.jpg",
     "twitter":"https://twitter.com/mariuszgil"
  },
  {  
     "description":"Wyznawca minimalizmu i maniak wszelkich idei, które usprawniają komunikację i wymianę wiedzy w zespole. Programistycznie od kilkunastu lat związany z PHP. Dba o przestrzeganie zasad: SOLID i czystej do bólu architektury. Założyciel łódzkiej myśli programistycznej: migawka.it",
     "id":3,
     "name":"Michał Cisz",
     "occupation":"Software Development Manager",
     "photoUrl":"https://2020.boilingfrogs.pl/wp-content/uploads/2020/02/mcisz2-1.jpg",
     "twitter":"https://twitter.com/michalcisz",
     "linkedin": "https://www.linkedin.com/in/michal-cisz"
  },
  {  
     "description":"Programista, czasem devops, preferuje Backend, toleruje Frontend, okazjonalnie speaker. Z Javą związany od 9, a z GO od 5 lat. Na co dzień pracuje w Nokii. Jeden z założycieli wrocławskiego GoWroc (Golang Wroclaw user group).",
     "id":4,
     "name":"Mateusz Dymiński",
     "occupation":"Software Developer at Nokia",
     "photoUrl":"https://2020.boilingfrogs.pl/wp-content/uploads/2020/02/dyminski.jpg"
  },
  {  
     "description":"Programista pasjonat, fan “Software Craftsmanship” i zwinnego podejścia do wytwarzania oprogramowania. Lubi proste rozwiązania skomplikowanych problemów.  Na codzień zajmuje się tematami z zakresu architektury aplikacji biznesowych, Domain-Driven Design, Continuous Delivery, technologii Java oraz testowania automatycznego. Prywatnie mąż, ojciec piątki dzieci.",
     "id":5,
     "linkedin":"https://www.linkedin.com/in/%C5%82ukasz-szyd%C5%82o-14754024/",
     "name":"Łukasz Szydło",
     "occupation":"Software Consultant/Architect/Trainer",
     "photoUrl":"https://2020.boilingfrogs.pl/wp-content/uploads/2020/02/szydlo-300x300-1.jpg",
     "twitter":"https://twitter.com/lszydlo"
  },
  {  
     "description":"Programista, inżynier, rzemieślnik, projektant i rowerzysta.Korzysta z każdej technologii, która prowadzi do celu.Wierzy w ludzi, a nie w papiery. Jest wyznawcą DevOps i wszelkiej automatyzacji.Jak przystało na człowieka inteligentnego, prowadzi bloga – https://stapp.space/Od czerwca 2018 znany jako “główny” dotnetomaniak.Na codzień główny architekt w FinAi oraz Microsoft MVP.",
     "id":6,
     "name":"Piotr Stapp",
     "occupation":"Software Architect at FinAi",
     "photoUrl":"https://2020.boilingfrogs.pl/wp-content/uploads/2020/02/stapp.jpeg",
     "twitter": "https://twitter.com/ptrstpp950",
     "linkedin": "https://www.linkedin.com/in/piotrstapp/"
  },
  {  
     "description":"Miałem szczęście obserwować rozwój IT: od Atari 2600 i C64 poprzez Amigę do współczesnych PC i Clouda. Doświadczając po drodze całego spektrum technologii i wielopoziomowych problemów z tym związanych. Pracowałem zarówno jako QA jak i DEV dzięki czemu wiem, że Excele są tak samo czerwone po każdej stronie. Obecnie łącze te działy, zajmując się testami wydajnościowymi i performance tuningiem. Gdy dzieci już śpią bawię się w gamedev lub retro.",
     "id":7,
     "name":"Sebastian Korczyk",
     "occupation":"Software Developer",
     "photoUrl":"https://2020.boilingfrogs.pl/wp-content/uploads/2020/02/Sebastian_Korczyk.jpg"
  },
  {  
     "description":"Kilkanaście lat doświadczenia, wiele błędów i porażek ale i dostarczonych systemów. Tak naprawdę gdzieś w głębi nadal jestem matematykiem-topologiem, może dlatego lubię Scalę, programowanie funkcyjne i takie tam. Ale także systemy rozproszone, przetwarzanie strumieniowe, Flinka i tym podobne. Przez prawie całe dorosłe życie (tzn. w IT) w TouK – jako deweloper, architekt, analityk i kto tam akurat jest potrzebny",
     "id":8,
     "name":"Maciek Próchniak",
     "occupation":"Software developer at Touk",
     "photoUrl":"https://2020.boilingfrogs.pl/wp-content/uploads/2020/02/prochniak-e1580729224570.jpg",
     "twitter":"https://twitter.com/mpproch",
     "linkedin": "https://www.linkedin.com/in/maciej-prchniak-139b3110/"
  },
  {  
     "description":"Najpierw marzył o zajmowaniu się sieciami, potem wylądował jako javowiec w projektach webowych. Później, po rocznej przygodzie jako konsultant CI/CD zobaczył, jak ogromną wartość mogą przynieść te metodyki w zespołach i usprawnianiu procesu wytwarzania oprogramowania. Obecnie na przemian wykorzystuje swoje twarde kompetencje java/devops oraz wspiera w rozwoju zespoły, w których pracuje w Boldare. Szerzy kulturę transparencji, zaufania oraz sprawnej komunikacji. Po pracy wsiada na rower albo planuje kolejne wypady, aby wraz z żoną poznawać nowe okolice – bliższe i dalsze.",
     "id":9,
     "name":"Maciej Papież",
     "occupation":"Java Developer & Devops Engineer at Boldare",
     "photoUrl":"https://2020.boilingfrogs.pl/wp-content/uploads/2020/02/papiez.jpg",
     "twitter": "https://twitter.com/maciejpapiez",
     "linkedin": "https://www.linkedin.com/in/maciej-papiez/"
  },
  {  
     "description":"Programista z pasji od prawie półtorej dekady, profesjonalnie przeszło 8 lat. Lead UI Developer w BNY Mellon. Po godzinach Toastmaster, a także miłośnik podróży, gór oraz psychologii. Silnie nastawiony na innowacje technologiczne i rozwój osobisty.",
     "id":10,
     "name":"Marcin Milewicz",
     "occupation":"Lead UI Developer w BNY Mellon",
     "photoUrl":"https://2020.boilingfrogs.pl/wp-content/uploads/2020/02/milewicz.jpg",
     "linkedin": "https://www.linkedin.com/in/marcinmilewicz/"
  },
  {  
     "description":"Software Java Developer z 8-letnim doświadczeniem. Pasjonat testów automatycznych, dobrych praktych pisania kodu i dobrych praktych architektonicznych. Wierzę, ze umiejętności miękkie – jak komunikacja, autoprezentacja, zdolności dyskusyjne – stoją ramię w ramię z innymi zdolnościami programisty. Prywatnie mąż, ojciec, idealista i improwizator. Często w swoich prezentacjach stosjuę Techniki Improwizacji nabytych jako aktor jednego z wrocławskich Teatrów Improwizacji.",
     "id":11,
     "name":"Tomasz Przybylski",
     "occupation":"Software Developer",
     "photoUrl":"https://2020.boilingfrogs.pl/wp-content/uploads/2020/02/przybylski.jpg"
  },
  {  
     "description":"Programista o humanistycznych zainteresowaniach, fan NBA, wielbiciel dobrej architektury (nie tylko tej w kodzie) oraz wycieczek po górach. Od 2010 zawodowo związany z tworzeniem aplikacji webowych w języku PHP. Pracuje w Intive.",
     "id":12,
     "linkedin":"https://www.linkedin.com/in/karolkreft/",
     "name":"Karol Kreft",
     "occupation":"Symfony & PHP Developer",
     "photoUrl":"https://2020.boilingfrogs.pl/wp-content/uploads/2020/02/karol_75kb.png",
     "twitter":"https://twitter.com/karol_kreft"
  },
  {  
     "description":"Od kilku lat pełni rolę Scrum Mastera w brytyjskiej firmie IT. Doskonale czuje się w roli lidera służebnego dla swoich prężnie rozwijających się zespołów. Miłością do Agile zaraziła się kilka lata temu, kiedy to zaczęła uczęszczać na lokalne meet-up’y i konferencje poświęcone tej tematyce. Ewelina głęboko wierzy w stwierdzenie, iż jacy jesteśmy dla świata taki świat jest dla nas, dlatego też po godzinach współtworzy Fundację Gra o Sens.Poza pracą pasjonuje ją psychologia w zarządzaniu, taniec, śpiew, rysowanie oraz cosplay",
     "id":13,
     "name":"Ewelina Wyspiańska-Trojniarz",
     "occupation":"Scrum Master at NewVoiceMedia",
     "photoUrl":"https://2020.boilingfrogs.pl/wp-content/uploads/2020/02/ewelina.jpeg"
  },
  {  
     "description":"Pracuję na co dzień jako senior developer w JH (wearejh.com), jestem też współzałożycielem Gallinago. Pracuję jako trener prowadząc kursy z Magento. Bywam również prelegentem, występowałem m.in. na MeetMagento w Polsce i Rumunii, na PHPers Summit czy BB Days 4 IT.",
     "id":14,
     "name":"Maciej Sławik",
     "occupation":"Co-Founder at Gallinago & Senior Software Engineer at JH",
     "photoUrl":"https://2020.boilingfrogs.pl/wp-content/uploads/2020/02/slawik-e1580729052228.png",
     "twitter": "https://twitter.com/MaciejSlawik",
     "linkedin": "https://www.linkedin.com/in/maciej-slawik/"
  },
  {  
     "description":"Android Developer mieszkający we Wrocławiu. Jest członkiem grupy GDG Wrocław, organizatorem konferencji DevFest Wrocław, podcastu na żywo Piątki Na Produkcji oraz byłym organizatorem wrocławskiego meetupu Toast – Android Developers Meetup. Od ponad 6 lat jest w związku z urządzeniami mobilnymi. Uwielbia dzielić się tym, czego się nauczył, więc można go spotkać na różnych konferencjach, meetupach i okazjonalnie na blogu. Uważa, że umiejętności miękkie w procesie wytwarzania oprogramowania są niejednokrotnie ważniejsze, niż umiejętności techniczne. W wolnym czasie czyta książki, ogląda Dragon Ball i skróty z meczów NBA oraz gra w Pokemony.",
     "id":15,
     "name":"Mateusz Budzar",
     "occupation":"Android Developer w Kangaroo",
     "photoUrl":"https://2020.boilingfrogs.pl/wp-content/uploads/2020/02/MateuszBudzar.jpg",
     "twitter": "https://twitter.com/MateuszBudzar",
     "linkedin": "https://www.linkedin.com/in/mateuszbudzar/"
  },
  {  
     "description":"Jako dzieciak zakochałem się w programowaniu, a było to już ponad ćwierć wieku temu. Od tego czasu miałem wiele różnych związków językowo-technologicznych.\nObecnie najmocniej rozwijam się w obszarach .NET w powiązaniu z DDD, Event Storming’iem, Event Modeling’iem, Clean Code, TDD. Continuous Development – tak można nazwać pasjonata IT dlatego ciągle się rozwijam i uwielbiam poznawać nowe technologie.\nWyszedłem też do ludzi i występuję na różnych Polskich konferencjach i meetup-ach. Dzieląc się swoją wiedzą i doświadczeniami.\nOd 2017 roku prowadzę też blog MrDev.pl. Udało mi się też wystartować podcast o konferencjach i wystąpieniach publicznych After.conf.\nPrzeprowadziłem też kilkukrotnie warsztaty dotyczące: GIT Flow, TDD, Event Storming, Event Modeling.\nMoja najświeższa działalność to modelowanie aplikacji z wykorzystaniem Event Storming i Event Modeling. Można śledzić te poczynania w daily vlog’u Moje 5 minut.",
     "id":16,
     "name":"Krzysztof Owsiany",
     "occupation":"Programista .NET w Billennium",
     "photoUrl":"https://2020.boilingfrogs.pl/wp-content/uploads/2020/02/krzysztof_owsiany.jpg",
     "twitter": "https://twitter.com/k_owsiany",
     "linkedin": "https://www.linkedin.com/in/krzysztof-owsiany-1a218876/"
  },
  {  
     "description":"Od ponad 20 lat w branży IT, jako administrator baz danych, programista, architekt, manager i „inżynier od spraw katastrof”. Brałem udział w małych, średnich i nonsensownie dużych projektach, prowadzonych zgodnie zasadami „waterfall”, Agile oraz przy braku jakichkolwiek metodyk, z tym samym zawsze skutkiem. Co doprowadziło mnie do wniosku, że nieważne co robisz tak długo, jak robisz to dobrze, w najprostszy z możliwych sposobów i używasz właściwych narzędzi, które wykonają pracę za ciebie. W międzyczasie dałem się porwać ideą TDD oraz Software Craftmanship, do granic możliwości wyeksploatować tak piękne w swej prostocie pomysły jak REST i NoSQL, by potem porzucić je, by zgłębić tajniki „system thinking” i zachwycić się siłą jaką niesie z sobą „metafora” i odkryć, że rządzą nami te same prawa „natury”. Niepokorny wyznawca kościoła JVM, badacz bytecode’u i JIT oraz wszelkiej maści parserów, interpreterów i kompilatorów. Na co dzień walczący o lepszą wydajność w Neo4j. Od czasu do czasu można usłyszeć moje niskiej jakości żarty na temat architektury na konferencjach w Polsce. W wolnych chwilach trener w http://symentis.pl i autor bloga na http://geekyprimitives.wordpress.com/ oraz samozwańczy dyktator w radach programowych konferencji CoreDump, SegFault, JDD oraz 4Developers.",
     "id":17,
     "linkedin":"https://www.linkedin.com/in/jpalka/",
     "name":"Jarek Pałka",
     "occupation":"Performance Engineer",
     "photoUrl":"https://2020.boilingfrogs.pl/wp-content/uploads/2020/02/palka.jpg",
     "twitter":"https://twitter.com/j_palka"
  },
  {  
     "description":"Trener umiejętności społecznych, coach, absolwentka psychologii oraz Zarządzania Potencjałem Pracowników. Przez kilka lat odpowiadała za szkolenia pracowników w międzynarodowej korporacji. Aktualnie trener freelancer. Specjalizuje się w szkoleniach z zakresu umiejętności społecznych m.in. komunikacji, zarządzania zespołem, budowania zespołu, asertywności, rozwiązywania konfliktów, inteligencji emocjonalnej. Wyznaje pogląd, że bycie wykwalifikowanym specjalistą to za mało, a wysoko rozwinięte kompetencje społeczne są niezbędnym elementem sukcesu ludzi i całych organizacji.",
     "id":18,
     "linkedin":"https://www.linkedin.com/in/anita-przybyl/",
     "name":"Anita Przybył",
     "occupation":"Trainer w SOFT - SKILLS Anita Przybył",
     "photoUrl":"https://2019.boilingfrogs.pl/wp-content/uploads/2019/02/dubikowski-300x300.jpeg",
     "twitter":"https://twitter.com/anita_przybyl"
  },
  {  
     "description":"Architekt, Team Leader oraz programista związany z technologią .NET od ponad 12 lat. Absolwent Politechniki Warszawskiej i kierunku Informatyka o specjalizacji Inżynieria Oprogramowania. Zwolennik podejścia Software Craftsmanship, Agile, automatyzacji, Czystego Kodu oraz pragmatycznego rozwiązywania problemów zgodnie z ich klasą. Pasjonat tematów związanych z architekturą oprogramowania i projektowaniem systemów. Entuzjasta i praktyk Domain-Driven Design. Popularyzator architektury Modularnego Monolitu oraz wysokiej jakości programowania obiektowego. Przemyślenia i wnioski opisuje na swoim blogu https://www.kamilgrzybek.com i Twitterze: @kamgrzybek.Związany z firmą ITSG Global, gdzie jako architekt, programista i konsultant odpowiedzialny jest za wytwarzanie oprogramowania dla firm z branży finansowej, medycznej i Big Data. Prywatnie – mąż, tata ukochanej córeczki, opiekun niesfornego psa, biegacz – amator i pasjonat samodoskonalenia żyjący zgodnie z Sokratesową dewizą – “wiem, że nic wiem”.",
     "id":19,
     "linkedin":"https://www.linkedin.com/in/kamilgrzybek",
     "name":"Kamil Grzybek",
     "occupation":".NET Software Developer / Architect / Team Leader",
     "photoUrl":"https://2020.boilingfrogs.pl/wp-content/uploads/2020/02/KamilGrzybekBioImage_small-1.jpg",
     "twitter":"https://twitter.com/kamgrzybek"
  },
  {  
     "description":"Combining quality engineering, software engineering, and business analysis, ingredients, into one, hefty meal, called Product Engineer. Programme committee chair of Agile & Automation Days, conference dedicated to achieving higher velocity in delivering software. Has been giving speeches, workshops, and trainings around Poland, Europe, and World. Always eager to learn. Doesn’t believe in silos. To improve your product, one needs to become a fluid, that adapts to environment and fills it.",
     "id":20,
     "linkedin":"https://www.linkedin.com/in/bartszulc/",
     "twitter": "https://twitter.com/bartszulc",
     "name":"Bart Szulc",
     "occupation":"Senior Product Engineer at Spartez/Atlassian",
     "photoUrl":"https://2020.boilingfrogs.pl/wp-content/uploads/2020/02/szulc.png"
  },
  {  
     "description":"Notoryczny inżynier w pracy i poza nią, podążający za meandrami sztuki programowania. Zawodowo Remote Freelance Software Gardener, od kilku lat wyrywający chwasty w ogródkach webowych i zwykle przycinający Javę do kształtów pożądanych przez klientów. Miłośnik lekkości i zwinności, która powinna przejawiać się przede wszystkim w stosowaniu właściwych narzędzi. Lead developer, trener, prelegent.",
     "id":21,
     "name":"Piotr Przybył",
     "occupation":"Remote Freelance Developer",
     "photoUrl":"https://2020.boilingfrogs.pl/wp-content/uploads/2020/02/przybyl.jpg",
     "twitter":"https://twitter.com/piotrprz",
     "linkedin": "https://www.linkedin.com/in/piotrprzybyl/"
  },
  {  
     "description":"Ola Kunysz tworzy oprogramowanie od 13 lat. Pisała backendy, frontendy i kod biznesowy, zbierała wymagania, testowała i szkoliła. Pracowała w korporacjach, startupach i pro bono w różnych branżach i krajach. Najbardziej lubi pisać kod, który ma znaczenie i rozwiązywać prawdziwe problemy. Kiedy jest offline, jeździ na rowerze, spaceruje z psem, albo ćwiczy jogę z kotami.",
     "id":22,
     "linkedin":"https://www.linkedin.com/in/akunysz/",
     "name":"Ola Kunysz",
     "occupation":"lider zespołu",
     "photoUrl":"https://2020.boilingfrogs.pl/wp-content/uploads/2020/02/kunysz_ola.jpg",
     "twitter":"https://twitter.com/olaqnysz"
  },
  {  
     "description":"Od drugiej klasy podstawówki chciałem zajmować się komputerami. Azymut na programistę utrzymałem do studiów, na których zrozumiałem, że droga IT managera fascynuje mnie jeszcze bardziej.Od tego czasu pracowałem w korporacji, agencji interaktywnej, kilku software house’ach, firmach produktowych, game devie, przy rozwiązaniach pudełkowych i szytych na miarę. Obecnie kieruję wrocławskim biurem STX Next – pythonowego software house’u.",
     "id":23,
     "name":"Marcin Zabawa",
     "occupation":"Head of Service Delivery at STX Next (python powerhouse)",
     "photoUrl":"https://2020.boilingfrogs.pl/wp-content/uploads/2020/02/zabawa.jpg",
     "linkedin": "https://www.linkedin.com/in/zabawa/"
  },
  {  
     "description":"Polyglot programmer z wieloletnim stażem oraz doświadczeniem w projektach dużych i małych. Jego ścieżka kariery wiodła prowadziła przez wiele języków programowania m.in. ActionScript, PHP, Perl, C++, Python, CoffeeScript, JavaScript, ostatnio Java i TypeScript. Uważa, że idealny programista powinien znać perfekcyjnie conajmniej jeden język dynamiczny i jeden statyczny. Do tej pory miał okazję realizować projekty m.in. z sektora publicznego, przetwarzania wideo w czasie rzeczywistym oraz analizy obrazów przy wykorzystaniu sieci neuronowych (również w Javie :))). Od czasu tego ostatniego dość sceptycznie nastawiony do możliwości przejęcia kontroli nad światem przez sztuczną inteligencję. Po godzinach próbuje dotrzymać tempa swojej trójce dzieci no i marzy o Tesli ",
     "id":24,
     "linkedin":"https://www.linkedin.com/in/marek-b%C4%99dkowski-4844bb177",
     "name":"Marek Będkowski",
     "occupation":"Software Developer/Technical Architect",
     "photoUrl":"https://2020.boilingfrogs.pl/wp-content/uploads/2020/02/marek_bedkowski_small.jpg",
     "twitter":"https://twitter.com/bendi007/"
  },
  {  
     "description":"W branży IT działam od 2005 roku. Zawodowo zajmuję się tworzeniem aplikacji internetowych i mobilnych a także zarządzaniem zespołami programistów. Specjalizuję się w technologiach Ruby on Rails oraz Elixir. Dodatkowo prowadzę podcast skierowany do branży IT oraz blog programistyczny. Oprócz programowania staram się inspirować ludzi z branży do ciągłego rozwoju i poszerzania swoich horyzontów.",
     "id":25,
     "name":"Krzysztof Kempiński",
     "occupation":"Podcaster at porozmawiajmyoit.pl",
     "photoUrl":"https://2020.boilingfrogs.pl/wp-content/uploads/2020/02/kempinski_-1.jpg",
     "twitter": "https://twitter.com/k_kempinski",
     "linkedin": "https://www.linkedin.com/in/kkempinski/"
  },
  {  
     "description":"Software Development Manager at Ocado Technology. 8 years of experience working as a Software Engineer, Leader, Agile Trainer and Development Manager. As an engineer, passionate about craftsmanship, propagating clean code, automated tests, behaviour-driven development and domain-driven design. As a leader, helps to build an organizational culture based upon autonomy, collaboration, and trust so that developers are equipped with both the hard and soft skills necessary to build truly awesome products. Tomek loves to change the reality around. He is highly pragmatic, challenge orthodoxy at all levels and believes that there is always room for improvement. Always eager to share and discuss ideas.",
     "id":26,
     "linkedin":"https://www.linkedin.com/in/tomasz-dubikowski",
     "name":"Tomasz Dubikowski",
     "occupation":"Software Development Manager at Ocado Technology",
     "photoUrl":"https://2020.boilingfrogs.pl/wp-content/uploads/2020/02/dubikowski.jpeg",
     "twitter":"https://twitter.com/tdubikowski"
  },
  {  
     "description":"Programista z 10-letnim doświadczeniem. Specjalizuje się w dostarczaniu prostych i wydajnych rozwiązań opartych na JVM. Na codzień zajmuje się tematami z zakresu architektury aplikacji biznesowych, zwinnego wytwarzania oprogramowania oraz continuous delivery. W pracy programisty najbardziej pasjonuje go rozwiązywanie problemów dotyczących procesu wytwarzania oprogramowania jako całości i budowanie samoorganizujących się zespołów. Uwielbia dzielić się wiedzą oraz szerzyć dobre praktyki, przed którymi branża bankowa nieustannie się opiera. Wyznaje pogląd, że bycie wykwalifikowanym programistą to za mało, a umiejętności komunikacji w zespole i produktywnego planowania są w dzisiejszym świecie niezbędne do osiągnięcia swoich celów. Obecnie zafascynowany pracą mózgu, produktywnością i biohackingiem.",
     "id":27,
     "name":"Sławomir Plamowski",
     "occupation":"Software Developer",
     "photoUrl":"https://2020.boilingfrogs.pl/wp-content/uploads/2020/02/plamowski.jpg"
  },
  {  
     "description":"Zawodowo: Engineering Manager w Finder.com\nHistorycznie: Programista.Mentalnie: Człowiek który utknął w latach 80W wyzwaniach uwielbiam się w skokach na głęboką wodę – albo się szybko nauczy pływać, albo utonie. Preferuję agnostyczne podejście do programowania, gdzie język jest narzędziem, a prawdziwa potęga tkwi w Problem Solving.",
     "id":28,
     "name":"Maciej Król",
     "occupation":"Engineering Manager w Finder.com",
     "photoUrl":"https://2020.boilingfrogs.pl/wp-content/uploads/2020/02/krol.jpg",
     "linkedin": "https://www.linkedin.com/in/maciej-krl-168a61105/"
  }
],
"speechSlots":[  
  {  
     "id":1,
     "timeLabel":"9:10 - 9:30"
  },
  {  
     "id":2,
     "timeLabel":"9:50 - 10:35"
  },
  {  
     "id":3,
     "timeLabel":"10:55 - 11:40"
  },
  {  
     "id":4,
     "timeLabel":"12:00 - 12:45"
  },
  {  
     "id":5,
     "timeLabel":"12:50 - 13:05"
  },
  {  
     "id":6,
     "timeLabel":"14:00 - 14:15"
  },
  {  
     "id":7,
     "timeLabel":"14:20 - 15:05"
  },
  {  
     "id":8,
     "timeLabel":"15:25 - 16:10"
  },
  {  
     "id":9,
     "timeLabel":"16:30 - 17:15"
  },
  {  
     "id":10,
     "timeLabel":"17:35 - 18:20"
  }
],
"speeches":[  
  {  
     "description":"Wstępniak",
     "id":1,
     "path":1,
     "speakerId":1,
     "speechSlotId":1,
     "title":"Boiling Frogs: Co może pójść nie tak!?"
  },
  {  
     "description":"Bounded contexty, agregaty, encje, VOs, repozytoria czy serwisy – wszystkie wzorce strategicznego i taktycznego Domain Driven Design pomagają mocno porządkować i strukturalizować projekt. Odpowiedzialności poszczególnych elementów pozwalają łatwo wpisywać je w ogólny design systemu, bez wprowadzania niepotrzebnego chaosu i couplingu.\nCzasem jednak sam model domeny jest mocno  złożony i rozbudowany. Ujawniają się w nim struktury wielkoskalowe DDD, które nałożone ponad wzorcami taktycznymi, pozwalają na jeszcze lepszą organizację i przygotowanie projektu do przyszłych zmian. Jedna ze struktur, tzw. Warstwy Odpowiedzialności, pozwalają wyróżniać warstwy Możliwości, Operacji, Zobowiązań, Polityk czy Wsparcia Decyzji, obejmujących swoim działaniem rozłączne obszary modelu.\nPodczas prezentacji przyjrzymy się konceptom N-warstwowego modelu domenowego, heurystykom wyznaczania granic oraz zastosowaniem ich przy pracy z projektem.",
     "id":2,
     "path":1,
     "speakerId":2,
     "speechSlotId":2,
     "title":"N-warstwowe modele domenowe"
  },
  {  
     "description":"Za późno mi powiedzieli, że ten projekt startuje! Brak czasu na analizę. Bye bye czysta architektura. Teraz to już zostaje mi tylko dopisanie modułu do brzydkiego monolitycznego legacy. Tego z nudną, trudną, nietykalną architekturą, która wita mnie przy kubku porannej kawy.\nA może nie jest za późno? Na konkretnym przykładzie pokażę Ci pewną drogę – sposób myślenia, dzięki któremu, z każdym projektem, będziesz coraz bliżej marzenia o lepszej architekturze. Jak wybrać właściwą bibliotekę? Jakie zależności uwzględnić przy wyborze architektury wdrożeniowej? Jak z głową zaaplikować wybrany wzorzec architektoniczny, aby nie doprowadzić do wielkiej przebudowy w kodzie legacy lub niechcący przekroczyć bezpieczny load cpu na produkcji? W oparciu o studium przypadku odpowiemy na postawione pytania. A na podstawie odpowiedzi, na koniec, powstanie checklista, której będziesz mógł użyć w przyszłości.",
     "id":3,
     "path":2,
     "speakerId":3,
     "speechSlotId":2,
     "title":"Mali wojownicy wielkiego legacy"
  },
  {  
     "description":"This session contains set of best practices for managing and configuring applications in Linux container(docker, containerd, rkt, etc). We will cover the following topics:\nChoosing best Docker base image\nGraceful Shutdown – handling SIGINT and other signals\nFast and Efficient Docker Builds\nLogging\nExposing metrics\nIntelligent Health Checks\nApplication configuration – reloading app configuration without downtime",
     "id":4,
     "path":3,
     "speakerId":4,
     "speechSlotId":2,
     "title":"Apps in Containers – Best Practices for containerised Apps"
  },
  {  
     "description":"Zdarza się, że ślepo dążymy do modularnego kodu, dla samego faktu modularności i enkapsulacji. Stawiamy równoważnik między „modularny” a „dobry”. Nie bierzemy pod uwagę, że modularność niesie są sobą koszty. Pytanie czy zawsze opłacalne jest dla nas ich ponoszenie.",
     "id":5,
     "path":1,
     "speakerId":5,
     "speechSlotId":3,
     "title":"DDD w systemach rozproszonych"
  },
  {  
     "description":"W epoce buzzwords gdzie wiodą prym DDD, BDD, K8S, ES, DevOps, CloudNative, Serverless czy nawet SPA, linked in driven CV’s jak i ekspert mode retweets fajnych skrótów, zapominamy o podstawach. Potrafimy zaprojektować system, a potem nagle za węgla uderza w nas PROBLEM i leżymy jak dłudzy. Aż nie sposób się podnieść. Najgorsze jest to, że jako środowisko wpadamy cały czas w to samo i wymyślamy koło na nowo albo Amerykę w konserwie. A wystarczy usiąść na chwilę i pomyśleć o podstawach. Na sesji w sposób lekko humorystyczny porozmawiać o tematach, które inżynierowie powinni znać a których nie da się łatwo RTeetnąć.",
     "id":6,
     "path":2,
     "speakerId":6,
     "speechSlotId":3,
     "title":"To są przecież podstawowe rzeczy"
  },
  {  
     "description":"Testy wydajnościowe są jak cebula – mają warstwy. I uwaga: na każdej z nich czają się problemy, czekające na nieświadomych nieszczęśników. Dlatego opowiem o tym na co warto zwrócić uwagę żeby później nie bolało lub bolało mniej. W końcu lepiej uczyć się na błędach innych bo możemy nie mieć dość czasu aby je wszystkie samemu popełnić. Powiem również co wspólnego miał Sir Terry Pratchett z testami wydajnościowymi. Prezentacja techniczna, przekrojowa. Zaprezentuję jakie mamy etapy w testach wydajnościowych, na jakie rzeczy warto zwrócić uwagę na każdym z nich i w jakie pułapki można się wpakować.",
     "id":7,
     "path":3,
     "speakerId":7,
     "speechSlotId":3,
     "title":"Testy wydajnościowe - to proste (*)"
  },
  {  
     "description":"Dawno temu, na studiach, uczyłem się o ACID – brzmiało sensownie. Ale potem poszedłem do pracy i dowiedziałem się jak różnie dostawcy baz danych rozumieją np. pojęcie izolacji...\nPotem, około 2009 roku dowiedziałem się o NoSQL, twierdzeniu CAP – no i to też było całkiem rozsądne. Ale potem kolejny twórcy baz zaczęli twierdzić że pokonali CAP (* tzn. w następującym rozumieniu – i tutaj długi i mętny wywód...)\nA potem zająłem się strumieniami, Kafką i oni mieli oczywiście własne rozumienie transakcji...\nChciałbym spróbować trochę opowiedzieć o różnych rodzajach spójności, izolacji itd – co one tak naprawdę znaczą i kiedy w sumie czego potrzebujemy? Oczywiście będzie to w sporej mierze oparte na własnych, czasami niełatwych doświadczeniach...",
     "id":8,
     "path":1,
     "speakerId":8,
     "speechSlotId":4,
     "title":"Transakcyjność w 2020 - co to właściwie znaczy?"
  },
  {  
     "description":"We’ve all been there – spotkanie, na którym wszyscy są, nikomu nie zależy, a problem po dwóch godzinach pozostaje nierozwiązany. Albo, być może co gorsza, wszystkim zależy, a problem po trzech godzinach pozostaje nierozwiązany, urósł i pojawiły się 3 kolejne. Od kiedy uświadomiłem sobie, że dobry deweloper w zespole może sprawić, że Scrum Master jest mniej potrzebny, zauważyłem, że zastosowanie kilku prostych technik pozwala na bycie katalizatorem spotkań, które:\n- każdemu pozwalają na wyrażenie swojej opinii\n- prowadzą do rozwiązania danego problemu w zaplanowanym czasie\n- są konstruktywne, ale też na tyle luźne, że uruchamiają kreatywność\nTechniki, o których opowiem, dotyczą zarówno zachowań, ról poszczególnych osób, procesów, jak i samych dyskutowanych zagadnień. Możesz je zaaplikować do niskopoziomowych dyskusji, kiedy szukacie najlepszego sposobu na refaktoryzację kodu, jak i omawiając wysokopoziomowo z Product Ownerem jego potrzeby biznesowe.",
     "id":9,
     "path":2,
     "speakerId":9,
     "speechSlotId":4,
     "title":"10 sposobów, abyś mniej nienawidził spotkań"
  },
  {  
     "description":"Czy microfrontends to rewolucyjne podejście i warto je wdrażać? Zalety stosowania microservices zostały opowiedziane już setki razy, ale co z monolitami frontendowymi? W prezentacji nie tylko przedstawie Wam co kryje się za pojęciem microfrontendów, ale także pokażę jak zastosować to podejście w prosty i praktyczny sposób.",
     "id":10,
     "path":3,
     "speakerId":10,
     "speechSlotId":4,
     "title":"Microfrontends – czyli jak wdrożyć idee microservices na frontendzie"
  },
  {  
     "description":"Czasami patrząc na kod testowy można wywnioskować, co kryje się na kodzie produkcyjnym. Błędny design czy słaba testowalność kodu jest jednym z wielu problemów jakie możemy napotkać podczas czytania takiego testu. Czy dobrze zastosowałem Test Doubles? Czy moja aplikacja ma możliwosć testowania? Czy posiada dobrą strukturę? Przestudiujemy kilka use case’om wnioskując czy struktura jaką dobraliśmy w naszej aplikacji jest odpowiednia do naszych potrzeb, spoglądając najpierw na kod źródłowy już napisanych testów. W rezultacie będzemi mogli porozmawiać o proponowanych rozwiązaniach i omówić ich słuszność.",
     "id":11,
     "path":1,
     "speakerId":11,
     "speechSlotId":5,
     "title":"Show me your test code and I tell you how production works"
  },
  {  
     "description":"W ciągu ostatnich 2 lat wystąpiłem przed ponad tysiącem programistów na meetupach i konferencjach w wielu miastach w całej Polsce. Warszawa, Gdańsk, Poznań, Wrocław, Szczecin czy Szczyrk – zawsze próbowałem nawiązać kontakt ze słuchaczami, poznać ich zdanie i znaleźć odpowiedź na pytanie jaką wartość ma to co robię, czy wnosi coś nowego i co powinienem poprawić. Tymczasem standardowy feedback to brak jakiegokolwiek feedbacku.\nAnalogiczna sytuacja ma miejsce w naszych zespołach. Pracujemy razem, razem rozwiązujemy problemy ale czy wspólnie wymieniamy się spostrzeżeniami dotyczącymi tego co w naszym podejściu do pracy działa a co kuleje? Czy potrafimy określić mocne i słabe strony współpracowników? I co równie ważne, czy wiemy jak to zakomunikować. W prezentacji podzielę się swoimi doświadczeniami dotyczącymi dawania feedbacku, co powinien zawierać i jak go przekazywać by osoba, której został udzielony wyniosła z niego jak najwięcej.",
     "id":12,
     "path":2,
     "speakerId":12,
     "speechSlotId":5,
     "title":"Chcę wiedzieć co myślisz czyli rzecz o feedbacku"
  },
  {  
     "description":"Poczucie sensu ma głęboki wpływ na naszą motywację wenętrzną. Gdy go brakuje najzwyczajniej w świecie nie chce nam się wstać rano z łóżka, czy iść na kolejne dłużące się spotkanie. Jak zatem odkrywać i nadawać sens naszym działaniom, aby chciało nam się chcieć? Na to i kilka innych pytań spróbujemy odpowiedzieć podczas prelekcji.",
     "id":13,
     "path":3,
     "speakerId":13,
     "speechSlotId":5,
     "title":"Poczucie sensu kluczem do budowania motywacji wewnętrznej"
  },
  {  
     "description":"Od jakiegoś czasu pracuję dla zdalnie dla firmy z Wielkiej Brytanii jako programista. Chciałbym opowiedzieć o tym, jak wygląda praca zdalna dla zagranicznej firmy, w jaki sposób szukać pracy za granicą i w jaki sposób zwiększyć swoje szanse na zatrudnienie. Postaram się wskazać plusy i minusy takiego modelu.",
     "id":14,
     "path":1,
     "speakerId":14,
     "speechSlotId":6,
     "title":"O pracy zdalnej dla firmy z zagranicy"
  },
  {  
     "description":"Szacowanie czasu wykonania zadania. Tak niewinnie to brzmi, a tak wiele od tego zależy. Opowiem o tym, co może pójść nie tak i co zrobić, żeby tak się nie stało.",
     "id":15,
     "path":2,
     "speakerId":15,
     "speechSlotId":6,
     "title":"Nie zgaduj"
  },
  {  
     "description":"Wszedłem w świat wystąpień publicznych. Nie było to łatwe, pierwsze moje wystąpienie było tak słabe, że chciałem nigdy więcej tego nie robić. Jednak mam za sobą obecnie ponad 30 wystąpień jako prelegent/trener.\nBardzo częstym problemem jest stres, jaki rodzi się w powiązaniu z wystąpieniami publicznymi.\nPo przeprowadzeniu wielu prezentacji często nie czuję już takiego paraliżu jak w pierwszych wystąpieniach. Jednak czasem pojawia się paraliżująca sytuacja. To skłoniło mnie do ciekawego wniosku. Stres trzeba doświadczać i rozwijać się.\nJak radziłem sobie z tym problemem i przy okazji kształtowałem swoje możliwości jako mówca. Czyli o niekonwencjonalnym podejściu do zapanowania nad stresem i wychodzeniu na scenę.",
     "id":16,
     "path":3,
     "speakerId":16,
     "speechSlotId":6,
     "title":"Doświadczaj stresu - hakowanie prelegenta"
  },
  {  
     "description":"Czasy się zmieniają. Systemy informatyczne wtargnęły burtalnie w nasze życie a oprogramowanie zjada ludzkość na śniadanie.\nW międzyczasie w naszych kieszeniach zagościło osiem rdzeni i 8 Gb RAM. Firma AMD zaprezentowała 12 rdzeniowy procesor na tzw. rynek konsumencki.\nA GMail jak się zacinał przy przewijaniu maili tak się zacina. Aby edytować plik tesktowy potrzebujemy 2 Gb RAM’u, a pewna aplikacja która pełni takie same funkcje co IRC w latach 90tych pożera każdą ilość CPU i pamięci.\nI nikt się tym nie przejmuje. Przecież sprzęt jest tańszy niż czas programisty. Czy to prawda?\nOdkąd na ustach architektów zagościły na stałe takie słowa jak chmura, czy serverless, powtarzana od lat prawda stała się fałszem.\nPodczas prezentacji chciałbym się z wami zastanowić nad odpowiedzią na pytanie postawione w tytule prezentacji, czy wydajność to jakość?\nJak zapewnić wydajność waszych systemów?\nKto za to wszystko jest odpowiedzialny ( ze smutkiem ogryjemy na końcu, że to dział HR:))\nJak to się wszystko ma do krakowskiego smogu.\nOpowiem jak zacząć z testowaniem wydajności. Jakie techniki, narzędzia i umiejętności musimy posiąść. I dlaczego “człowiek od wydajności” to najlepszy zawód na świecie.",
     "id":17,
     "path":1,
     "speakerId":17,
     "speechSlotId":7,
     "title":"Czy wydajność to jakość?"
  },
  {  
     "description":"Większość swoich sukcesów w pracy i nauce uważasz za przypadek? Swoją pozycję najwyraźniej osiągnąłeś jedynie dzięki łutowi szczęścia? Twoi współpracownicy ewidentnie mają lepsze kwalifikacje niż ty? Boisz się, że kiedyś ktoś odkryje, że w rzeczywistości jesteś niekompetentny? Syndrom Oszusta: czy dotyczy także Ciebie? Czym właściwie jest ten syndrom? Czym się objawia oraz jak sobie z nim radzić?",
     "id":18,
     "path":2,
     "speakerId":18,
     "speechSlotId":7,
     "title":"Syndrom oszusta - czyli hamulec rozwoju. Czym jest, czy dotyczy ciebie i jak sobie z nim radzić"
  },
  {  
     "description":"“Jeden, by wszystkimi rządzić, jeden, by wszystkie odnaleźć, Jeden, by wszystkie zgromadzić i w ciemności związać.”\n\nZachłyśnięcie się architekturą mikrousługową trwa już ładnych parę lat. Falstart jaki popełniliśmy w IT adoptując architekturę systemu rozproszonego bez uzasadnionych driverów architektonicznych boli niejeden zespół developerski i utrzymaniowy do dnia dzisiejszego. Historia lubi zataczać krąg, dlatego do łask wracają niechlubne “Monolity”. Czy rzeczywiście architektura monolityczna jest zła?\n\nNa prezentacji zostanie omówiony Modularny Monolit – młodszy brat monolitu, który dba o dobre imię architektur monolitycznych. Omówione zostaną główne cechy takiego systemu jak modularność oraz drivery architektoniczne, które za tą architekturą przemawiają wraz z tymi, które skłaniają do podziału Monolitu i migracji do architektury mikrousługowej.\n\nPodczas sesji zaprezentowany zostanie jeden ze sposóbów zaprojektowania Modularnego Monolitu, zgodny z najlepszymi praktykami i wzorcami projektowymi znanymi w środowisku inżynierii systemów IT.\n\nCzy “One Monolith to rule them all” ma uzasadnienie w praktyce? Przekonajmy się.",
     "id":19,
     "path":3,
     "speakerId":19,
     "speechSlotId":7,
     "title":"Architektura Modularnego Monolitu: Jeden, by wszystkimi rządzić"
  },
  {  
     "description":"“Chaos to najniebezpieczniejsza rzecz na tym świecie… również bardzo potężne narzędzie. Bez kontroli, chaos cię zniszczy.”\nNiektórzy z was pewnie rozpoznają powyższy cytat z Wiedźmina. Niestety w mojej prezentacji nie będzie smoków, czy demonów.\nMoże zaskakiwać jak chaos opisywany w Wiedźminie dobrze wpisuje się w świat wytwarzania oprogramowania. Szczególnie tego rozproszonego.\n\nPracując nad rozwiązaniami rozproszonymi, skalujący się, aby obsłużyć coraz to większy zapotrzebowanie, można być pewnym jednej rzeczy. Wszystko złego co się może wydarzyć, wydarzy się na pewno, jeżeli nie jest już w trakcie. Mówi nam o tym prawo wielkich liczb.\nNasz system jest w ciągłym stanie awarii. Świadomi rzeczywistości, mamy trzy ścieżki do wyboru.\nNajprostsza. Zignorowanie problemu. Akceptujemy ryzyko totalnego przestoju, modląc się by wszechświat był po naszej stronie.\nNiepraktyczna. Wpadamy w paraliż decyzyjny. Staramy się zaimplementować nasz system w taki sposób, aby był w stanie poradzić sobie z każdą nieprzewidzianą sytuacją. Gdzie jego zmiana jest praktycznie niemożliwa.\nW końcu pragmatyczna. Akceptujemy stan rzeczy i wykorzystujemy go na swoją korzyść. Zaczynamy zagłębiać się w nasz system. Eksplorujemy chaos. Eksperymentujemy, by zaobserwować niepożądaną reakcję. Wyprzedzić realia produkcyjne.\n\nJak Wiedźmin (ale serio… to już ostatni raz jak o nim wspominam), przeprowadzę was ścieżką pragmatyczną. Wprowadzę w Chaos Engineering. Opowiem czym jest. Jak się w to gra. Jakie typy ćwiczeń możecie przeprowadzić w swoich zespołach, aby uzyskać przewagę nad chaosem i trochę lepiej go kontrolować. Jako, że chaos jest potężny, a nasze systemy skomplikowane, opowiem również o tym jak być przygotowanym na przegraną z żywiołem. Czy jest root cause analysis, jak pomaga failure culture, dostęp do playbook, świadomość you build it you run it.\nObawiasz się, że prezentacja będzie za “mało techniczna”. Nie martw się. Jeżeli ceremonie nie są twoim konikiem, przedstawię też narzędzia oraz typy ataków, do których można je wykorzystać.",
     "id":20,
     "path":1,
     "speakerId":20,
     "speechSlotId":8,
     "title":"Spokojnie, to tylko kontrolowany chaos"
  },
  {  
     "description":"Wyczekowałeś Grzesiu brancza, tak jak cię prosiłam?\nWyczekowałem i pusznąłem bagfiksa, ciociu miła!\n\nPoznałeś w tym miesiącu dwa super kul frejmłorki, które pozwolą ricznąć więcej kipiajów? Fantastycznie, a kiedy ostatnio w twym ręku był słownik? Albo jakakolwiek książka (lub czasopismo)?\n\nWszystko się teraz informatyzuje, takie czasy. e-Urząd, e-commerce, e-tamto, e-siamto… Żeby to wszystko zrobić i utrzymać, potrzeba rzeszy informatyków i inżynierów. (I straszą, że ma być jeszcze gorzej.) Coraz więcej rzeczy przechodzi przez ręce naszej branżuni.\nLudzie narzekają na “arystokację IT”, że nie można jej zrozumieć. “Arystokracja” ma wysokie mniemanie o sobie i zadziera nosa jeszcze bardziej, bo nie po to studiowała pięć lat… itd. W tym celu coraz bardziej hermetyzuje swoje specyficzne narzecze, będące worem makaronizów, kalek językowych, nawet kanajackiej grypsery..\nTymczasem celem każdej arystokracji jest także dawanie przykładu, niesienie kaganka oświaty, dążenie do gwiazd.\n\nSpojler alert: prezentacja nie jest dla ludzi, którzy są obrażalscy i już wszystko wiedzą. Na tapet weźmiemy nasze przywary oraz cały ten bełkot, na który pozwalamy innym. Zapraszem serdecznie, choć miło może nie być.",
     "id":21,
     "path":2,
     "speakerId":21,
     "speechSlotId":8,
     "title":"#ąęszcz Rzecz o języku informatyków"
  },
  {  
     "description":"Podczas tej prezentacji opowiem o tym jak kupują ludzie spoza IT i dlaczego powinno nas to obchodzić. Pokażę dwie główne drogi implementacji wyszukiwania wizualnego oraz proces tworzenia i trenowania modelu do rozpoznawania zdjęć w oparciu o Fashion MNIST. A Pokemony posłużą mi do zaprezentowania wyzwań, jakie stoją na drodze do znajdowania właściwych obrazów. Zapraszam!",
     "id":22,
     "path":3,
     "speakerId":22,
     "speechSlotId":8,
     "title":"Wyszukiwanie wizualne, uczenie maszynowe i Pokemony"
  },
  {  
     "description":"Ta prelekcja jest dla Ciebie, jeśli przeglądając setną ofertę pracy myślisz raczej o sensie życia, niż o widełkach płacowych. Przyjdź i posłuchaj, jeśli wszyscy rzucają w ciebie hajsem, a Ty tymczasem zastanawiasz się gdzie będziesz czerpał satysfakcję z pracy, przeżywał przygody, gdzie będziesz mógł dążyć do osobistego mistrzostwa i robić coś, o czym z dumą można opowiadać dzieciom.\nW trakcie prelekcji będę bezwstydnie generalizował i porównywał duże firmy produktowe, startupy i software house’y pod kątem pozapłacowej jakości pracy. Zmierzę się w szczególności z opinią, że software house to miejsce dla ludzi bez pasji i misji, którzy sprzedają duszę za kasę lub święty spokój.",
     "id":23,
     "path":1,
     "speakerId":23,
     "speechSlotId":9,
     "title":"Czy pracując w software housie zmarnuję sobie życie?"
  },
  {  
     "description":"Założeniem hipotezy relatywizmu językowego Saphira-Whorfa są różnice w postrzeganiu świata w zależności o języka, którym się posługujemy. Wielojęzyczność oznacza dużo większą plastyczność mózgu, co przekłada się na lepsze zdolności komunikacyjne, większą otwartość oraz innowacyjne podejście do rozwiązywania problemów. Podczas prezentacji przejdziemy przez różne języki programowania pokazując ich specyfikę oraz jak te elementy mogą wpływać na sposób rozwiązywania problemów.",
     "id":24,
     "path":2,
     "speakerId":24,
     "speechSlotId":9,
     "title":"Relatywizm języków programowania"
  },
  {  
     "description":"Zapewne nigdy Twoja rozmowa telefoniczna nie została przerwana z powodu aktualizacji oprogramowania na urządzeniach telekomunikacyjnych. Dzieje się tak ze względu na niezawodność języka programowania jakim jest Erlang.\n\nW prelekcji opowiem trochę o tym języku i o jego młodszym bracie, Elixirze, stworzonym przez członka core teamu Ruby on Rails, brazylijczyka mieszkającego w Polsce, który to język, z uwagi na swą wydajność jest coraz mocniej używany przez startupy. Powiem jak programowanie funkcyjne, model współbieżności i podmiana kodu bez zatrzymywania serwera przyczyniają się do polepszenia niezawodności programów pisanych w Erlang i Elixir. Zobaczymy jak WhatsApp (napisany w Erlang) może obsługiwać 900 milionów użytkowników przy wsparciu tylko 50 osobowego zespołu inżynierskiego.",
     "id":25,
     "path":3,
     "speakerId":25,
     "speechSlotId":9,
     "title":"Niezawodność języków programowania na bazie Erlang i Elixir"
  },
  {  
     "description":"Mimo okiełznania wymagających arkan programowania i osiągnięcia technologicznych szczytów, ciągle zdarza nam się popełniać te same błędy. Lubimy oczekiwać wiele od innych, samemu naginając definicję profesjonalizmu. Krytykować, samemu krytycznych słów nie przyjmując. Narzekać, samemu nie robiąc oczekiwanych rzeczy. Przyglądniemy się zatem historiom kilku programistów, którzy na pewno mogliby zrobić kilka rzeczy lepiej. Dla siebie i dla wszystkich.",
     "id":26,
     "path":1,
     "speakerId":26,
     "speechSlotId":10,
     "title":"IT. Krótka historia o tym jak spieprzyliśmy wszystko"
  },
  {  
     "description":"Jednym z trudniejszych wyzwań przed jakimi stoją dzisiaj developerzy jest wdrażanie nowych osób do zespołu. Rotacja osób w zespole wprwadza chaos nawet w najlepiej naoliwionej maszynie, powoduje opóźnienia w dostarczaniu produktów, konflikty kulturowe i osobowościowe. A przecież tak być nie musi.\n\nWiększość firm na rynku posiada bardziej lub mniej sformalizowane sposoby wdrażania nowych osób do zespołu, ale zazwyczaj opierają się one na czytaniu nudnej dokumentacji lub odbywaniu niepotrzebnych treningów. Wielu osobom niezwiązanym bezpośrednio z IT wydaje się, że najważniejsze jest aby osoba dołączająca do zespołu była zasypana listą rzeczy do zrobienia w pierwszych tygodniach pracy, podczas gdy czego chcą developerzy to rozpoczęcie kodowania bez zbędnych ceremonii. Chcą poznać system od strony programistycznej i napisać swój pierwszy kod.\n\nW tej prezentacji opowiem o sposobach na wdrażanie nowych osób do zespołu. Przedstawię rozwiązania, z którymi spotkałem się w różnych firmach – zarówno te działające, jak i te denerwujące nowych pracowników.",
     "id":27,
     "path":2,
     "speakerId":27,
     "speechSlotId":10,
     "title":"Onboarding, czyli jak odróżnić najlepsze zespoły od tych przeciętnych"
  },
  {  
     "description":"Jak skutecznie komunikować się w zespołach, które dzielą godziny i tysiące kilometrów? Które narzędzia mogą nam w tym pomóc?\nCzy da się pracować w teamie, którego członkowie rozsiani są po różnych krajach i strefach czasowych?\nJakie zagrożenia projektowe, kulturowe i ludzkie czekają na nas, gdy nie ma nikogo pod ręką?\nPraca zdalna, a praca z biura. Która jest dla nas lepsza?\nJak spowodować żeby wideokonferencje w większej grupie nie były tak chaotyczne i często mało produktywne?\n\nNa wiele z tych pytań już sobie odpowiedzieliśmy, a dzisiaj chcemy podzielić się naszymi wnioskami i doświadczeniami.",
     "id":28,
     "path":3,
     "speakerId":28,
     "speechSlotId":10,
     "title":"Efektywne zarządzanie i praca w zespołach rozproszonych"
  }
]
}
