{
  "speakers" : [ {
    "photoUrl" : "https://2024.boilingfrogs.pl/wp-content/uploads/2023/09/avatar.jpeg",
    "twitter" : "https://twitter.com/tkaczmarzyk",
    "occupation" : "Software Developer",
    "name" : "Tomasz Kaczmarzyk",
    "description" : "Programowanie to moja pasja. Podczas swojej kariery zawodowej uczestniczyłem w pracy nad zarówno projektami zakończonymi sukcesem, jak i będącymi totalną porażką. Większość tego co wiem, nauczyłem się z tych drugich.\n\nMocno wierzę w manifest Software Craftsmanship. M.in. z tego powodu organizuję konferencję Boiling Frogs (http://boilingfrogs.pl) oraz otworzyłem software house Tratif (http://tratif.com), w którym jakość kodu jest zawsze na pierwszym miejscu.\n\nCzasami piszę na blogu (http://blog.tratif.com). Praktykuję Test Driven Development i godzinami mogę rozmawiać o testach automatycznych i ich czytelności.\n\nLubię wierzyć, że oprogramowaniem można zmieniać świat.",
    "id" : 102,
    "linkedin" : "https://www.linkedin.com/in/tkaczmarzyk/"
  }, {
    "photoUrl" : "https://2024.boilingfrogs.pl/wp-content/uploads/2024/01/wptak_agrzesik.jpg",
    "twitter" : "",
    "occupation" : "Head of Product Engineering & Java Champion",
    "name" : "Wojtek Ptak i Andrzej Grzesik",
    "description" : "Wojtek works as Head of Product Engineering and Engineering Executive at Revolut. Before, he worked as CTO for several companies, provided consulting, training, and assisted in building various data collecting, analytics, and applied ML/AI solutions, including Big Data implementations, data stream processing systems, and data insight projects. He worked with multiple Forbes 500 brands in the US, UK, and the Netherlands, including The Coca-Cola Company, the American Bankers Association, Macy’s, Bloomingdales, Heineken, Saks 5th Avenue, BP, Boots, Polo Ralph Lauren, Porsche, HSBC, and others.\n\nAndrzej likes distributed systems in all shapes and form. Coding since the age of 8, loves simplicity and continuous delivery. While he has written in many languages, he favours the JVM. Since „most software problems are people problems”, he stirs communities, organizes and speaks at conferences (proud to be a JavaONE Rockstar!). He is passionate about all things data, because science! In his spare time… cycling, photography and books. And he is a Java Champion!",
    "id" : 1,
    "linkedin" : "https://www.linkedin.com/in/wojtekptak/"
  }, {
    "photoUrl" : "https://2024.boilingfrogs.pl/wp-content/uploads/2024/01/images.png",
    "twitter" : "",
    "occupation" : "Java Champion",
    "name" : "Andrzej Grzesik",
    "description" : "Andrzej likes distributed systems in all shapes and form. Coding since the age of 8, loves simplicity and continuous delivery. While he has written in many languages, he favours the JVM. Since „most software problems are people problems”, he stirs communities, organizes and speaks at conferences (proud to be a JavaONE Rockstar!). He is passionate about all things data, because science! In his spare time… cycling, photography and books. And he is a Java Champion!",
    "id" : 2,
    "linkedin" : "https://www.linkedin.com/in/andrzejgrzesik/"
  }, {
    "photoUrl" : "https://2024.boilingfrogs.pl/wp-content/uploads/2024/01/Krzysztof-and-Pawel-Nerd-Management.jpeg",
    "twitter" : "",
    "occupation" : "Founders at Nerd Management",
    "name" : "Krzysztof Rakowski i Paweł Rekowski",
    "description" : "Krzysztof Krzysztof Rakowski jest doświadczonym liderem. Zaczynał w branży IT dwadzieścia lat temu jako webdeveloper. Obecnie jest dyrektorem pionu Supply Chain Management oraz zarządza warszawskim hubem IT firmy eMAG – lidera e-commerce w Europie południowo-wschodniej. Odpowiada za 9 zespołów developerskich i produktowych w dwóch krajach. W swojej pracy kieruje się transparencją i stawianiem człowieka na pierwszym miejscu. Uwielbia się uczyć i pomagać innym w rozwoju. Współprowadzi wideo podcast Nerd.Management, skierowany do świeżo upieczonych i przyszłych liderów w IT. Paweł Człowiek wielu pasji i zawodów – Przedsiębiorca, Programista, Lider, Mówca, Trener, Podcaster oraz finalista konkursu IT Manager of Tomorrow Awards, a poza tym tata dwóch rozrabiaków, poszukujący skutecznych sposobów jak Czuć się, Wyglądać i Żyć #Lepiej. Od ponad 14 lat w branży IT – od początku związany z PHP. Pracował dla takich marek jak Oferia, Allegro czy BlaBlaCar. Obecnie Team Leader w eMAG. Miłośnik ostrych brzmień, skutecznej komunikacji oraz uświadamiania programistów ile kosztuje ich praca. Razem z Krzysztofem prowadzi wideo podcast Nerd.Management, skierowany do świeżo upieczonych i przyszłych liderów w IT.",
    "id" : 3,
    "linkedin" : "https://www.linkedin.com/company/nerd-management/"
  }, {
    "photoUrl" : "https://2024.boilingfrogs.pl/wp-content/uploads/2024/01/mm_crop-1-930x620-1.jpg",
    "twitter" : "",
    "occupation" : "Frontend Tech Leader w Xebia",
    "name" : "Marcin Milewicz",
    "description" : "Programista z pasji od ponad dwóch dekad. Google Developer Expert (Web Technologies), Principal Developer, Frontend Architect oraz Frontend Tech Leader w Xebia Poland. Po godzinach Toastmaster, miłośnik podróży, gór oraz psychologii silnych stron. Silnie nastawiony na innowacje technologiczne oraz rozwój osobisty. Podcaster kanału “Na Froncie”.",
    "id" : 4,
    "linkedin" : "https://www.linkedin.com/in/marcinmilewicz/"
  }, {
    "photoUrl" : "https://2024.boilingfrogs.pl/wp-content/uploads/2024/01/kgrzybek.jpg",
    "twitter" : "https://twitter.com/kamgrzybek",
    "occupation" : "Head of Software Engineering / Architekt",
    "name" : "Kamil Grzybek",
    "description" : "Head of Software Engineering oraz Architekt – związany głównie z technologią .NET. Zwolennik podejścia Software Craftsmanship, automatyzacji, refactoringu, czystego kodu oraz pragmatycznego rozwiązywania problemów – zgodnie z ich klasą. Pasjonat tematów związanych z architekturą oprogramowania i projektowaniem systemów. Entuzjasta i praktyk Domain-Driven Design. Przemyślenia i wnioski opisuje na swoim blogu (https://www.kamilgrzybek.com/) i Twitterze: @kamgrzybek. Związany z firmą ITSG Global, gdzie jako architekt, programista i konsultant odpowiedzialny jest za wytwarzanie oprogramowania dla firm z branży finansowej, medycznej i Big Data. Trener DDD oraz architektury w Bottega IT Minds. Prywatnie – mąż, tata ukochanej córeczki, opiekun niesfornego psa, biegacz – amator i pasjonat samodoskonalenia żyjący zgodnie z Sokratesową dewizą – “wiem, że nic wiem”.",
    "id" : 5,
    "linkedin" : "https://www.linkedin.com/in/kamilgrzybek/"
  }, {
    "photoUrl" : "https://2024.boilingfrogs.pl/wp-content/uploads/2024/01/lreszke-1024x1024.jpg",
    "twitter" : "https://twitter.com/lreszke",
    "occupation" : "Software Developer",
    "name" : "Łukasz Reszke",
    "description" : "Na codzień pracuje w @arkency gdzie ratujemy projekty klasy legacy i szerzymy wiedzę o dobrych praktykach w świecie Railsowym. Wierzę w to że zrozumienie problemu i zaprojektowanie modelu dostosowanego do jego rozwiązania pozwala na stworzenie dobrego produktu dla biznesu. Produktu, który będzie zrozumiały i latwy do rozwijania dla innych programistów. Stad naturalnie ciągnie mnie do takich technik jak DDD i EventStorming.",
    "id" : 6,
    "linkedin" : "https://www.linkedin.com/in/lreszke"
  }, {
    "photoUrl" : "https://2024.boilingfrogs.pl/wp-content/uploads/2024/01/piotr_gankiewicz.jpeg",
    "twitter" : "https://twitter.com/spetzu",
    "occupation" : "Inżynier oprogramowania, współzałożyciel DevMentors.io",
    "name" : "Piotr Gankiewicz",
    "description" : "Inżynier oprogramowania, współzałożyciel DevMentors.io. kontrybutor open source rozwijający message streaming Iggy.rs",
    "id" : 7,
    "linkedin" : "https://www.linkedin.com/in/piotrgankiewicz/"
  }, {
    "photoUrl" : "https://2024.boilingfrogs.pl/wp-content/uploads/2024/01/jpalka.jpeg",
    "twitter" : "https://twitter.com/j_palka",
    "occupation" : "Performance Engineer",
    "name" : "Jarosław Pałka",
    "description" : "Od ponad 20 lat w branży IT, jako administrator baz danych, programista, architekt, manager i „inżynier od spraw katastrof”. Brałem udział w małych, średnich i nonsensownie dużych projektach, prowadzonych zgodnie zasadami „waterfall”, Agile oraz przy braku jakichkolwiek metodyk, z tym samym zawsze skutkiem. Co doprowadziło mnie do wniosku, że nieważne co robisz tak długo, jak robisz to dobrze, w najprostszy z możliwych sposobów i używasz właściwych narzędzi, które wykonają pracę za ciebie. W międzyczasie dałem się porwać ideą TDD oraz Software Craftmanship, do granic możliwości wyeksploatować tak piękne w swej prostocie pomysły jak REST i NoSQL, by potem porzucić je, by zgłębić tajniki „system thinking” i zachwycić się siłą jaką niesie z sobą „metafora” i odkryć, że rządzą nami te same prawa „natury”. Niepokorny wyznawca kościoła JVM, badacz bytecode’u i JIT oraz wszelkiej maści parserów, interpreterów i kompilatorów. Na co dzień walczący o lepszą wydajność w Neo4j. Od czasu do czasu można usłyszeć moje niskiej jakości żarty na temat architektury na konferencjach w Polsce. W wolnych chwilach trener w http://symentis.pl i autor bloga na http://geekyprimitives.wordpress.com/ oraz samozwańczy dyktator w radach programowych konferencji CoreDump, SegFault, JDD oraz 4Developers.",
    "id" : 8,
    "linkedin" : "https://www.linkedin.com/in/jpalka/"
  }, {
    "photoUrl" : "https://2024.boilingfrogs.pl/wp-content/uploads/2024/01/mmoroz.jpg",
    "twitter" : "",
    "occupation" : "Chief Innovation Officer i współzałożyciel Makimo",
    "name" : "Michał Moroz",
    "description" : "Michał Moroz – Chief Innovation Officer i współzałożyciel Makimo, software house i firmy konsultingowej IT. Programista przez 15 lat, na studiach zainteresował się przywództwem i rozwijał swoje umiejętności w Niezależnym Zrzeszeniu Studentów Regionu Łódzkiego. Prywatnie interesuje się przemawianiem publicznym i ćwiczy swoje umiejętności w klubie Speakers of Łódź i Łódź Toastmasters. Zawsze poszukuje nowych konceptów, które może włączyć do swojego postrzegania świata.",
    "id" : 9,
    "linkedin" : "https://www.linkedin.com/in/michalpiotrmoroz/"
  }, {
    "photoUrl" : "https://2024.boilingfrogs.pl/wp-content/uploads/2024/01/mlotko.jpg",
    "twitter" : "",
    "occupation" : "Software Developer",
    "name" : "Mariusz Lotko",
    "description" : "Od 22 lat zawodowy programista, od 18 lat śni na Javie.",
    "id" : 10,
    "linkedin" : "https://www.linkedin.com/company/boiling-frogs/"
  }, {
    "photoUrl" : "https://2024.boilingfrogs.pl/wp-content/uploads/2024/01/pzjc.jpg",
    "twitter" : "",
    "occupation" : "Software Developer",
    "name" : "Piotr Zając",
    "description" : "Inżynier związany z technologiami JVM. Entuzjasta stosowania rozwiązań dających możliwość zautomatyzowania powtarzalnej pracy w każdej sferze życia, w której jest to możliwe – co w ostatnim czasie zostało znacznie ułatwione poprzez rozwój narzędzi AI. Czas wolny spędza na graniu w gry planszowe, wspinaczce sportowej, bądź tworzeniu hobbystycznych aplikacji wspierających te zainteresowania.",
    "id" : 11,
    "linkedin" : "https://www.linkedin.com/in/ptrzjc/"
  }, {
    "photoUrl" : "https://2024.boilingfrogs.pl/wp-content/uploads/2024/01/mdomasz.jpeg",
    "twitter" : "",
    "occupation" : "HR Business Partner",
    "name" : "Marta Domasz",
    "description" : "Jestem HR Business Partnerką. Współpracuję bezpośrednio z Zarządami i kadrą menadżerską firm technologicznych i wspieram ich rozwój. Wierzę, że każda organizacja ma przed sobą praktycznie nieograniczony wzrost. Kwestia tego, kiedy da sobie pomóc. Pomagam biznesom uporządkować swoje procesy organizacyjne i kulturę firmy w takim sposób, by progres był tylko kwestią czasu. Lubię o sobie mówić, że jestem osobą, która ogarnia chaos w organizacji. Porządkuję procesy, postrzeganie, ludzi.",
    "id" : 12,
    "linkedin" : "https://www.linkedin.com/in/martadomasz/"
  }, {
    "photoUrl" : "https://2024.boilingfrogs.pl/wp-content/uploads/2024/01/pr-pawel-lewtak-large-cadf264230de47ab.jpg",
    "twitter" : "https://twitter.com/pawel_lewtak",
    "occupation" : "Software Developer",
    "name" : "Paweł Lewtak",
    "description" : "",
    "id" : 13,
    "linkedin" : "https://www.linkedin.com/company/boiling-frogs/"
  }, {
    "photoUrl" : "https://2024.boilingfrogs.pl/wp-content/uploads/2024/01/aprzybyl.jpg",
    "twitter" : "https://twitter.com/Anita_Przybyl",
    "occupation" : "Trenerka kompetencji społecznych, psycholog",
    "name" : "Anita Przybył",
    "description" : "Trenerka kompetencji społecznych, psycholog. Trenerka Bottega IT Minds. Specjalizuję się w rozwoju liderów, liderów technicznych, managerów oraz wyższej kadry zarządzającej w zakresie nowoczesnego leadershipu (m.in. idee i narzędzia management 3.0, servant leadership, coachingowy, partycypacyjny styl zarządzania oraz aktualna wiedza psychologiczna). Z liderami pracuję od kilku lat zarówno szkoleniowo jak i w indywidualnych sesjach coachingowych. Pracuję też nad rozwojem soft skilli z specjalistami IT oraz z całymi zespołami developerskimi w celu zwiększenia efektywności i satysfakcji. W swoich szkoleniach stawiam na naukę przez doświadczenie, kładąc nacisk na interaktywne, warsztatowe formy nauczania oraz intensywny trening umiejętności. Prelegentka na wielu konferencjach IT. Współorganizatorka i trenerka warsztatów Soft Skille Dla Programistów.",
    "id" : 14,
    "linkedin" : "https://linkedin.com/in/anita-przybyl"
  }, {
    "photoUrl" : "https://2024.boilingfrogs.pl/wp-content/uploads/2024/01/pkrysiak.jpg",
    "twitter" : "",
    "occupation" : "Head of Engineering Poland at BNY Mellon",
    "name" : "Piotr Krysiak",
    "description" : "Software Engineer z wieloletnim doswiadczeniem. Najlepiej czuje sie w asynchronicznych systemach klasy Enterprise. Obecnie jako manager poznaje branze z innej strony.",
    "id" : 15,
    "linkedin" : "https://www.linkedin.com/in/piotr-krysiak-800bb185/"
  }, {
    "photoUrl" : "https://2024.boilingfrogs.pl/wp-content/uploads/2024/01/ajelonek.jpg",
    "twitter" : "",
    "occupation" : "Senior Quality Assurance Engineer w eSky",
    "name" : "Arkadiusz Jelonek",
    "description" : "Senior Quality Assurance Engineer w firmie eSky. Swoją przygodę z IT rozpoczął od testowania aplikacji wbudowanych na telewizory i set-top boxy, a obecnie skupia się na testowaniu aplikacji webowych i mobilnych. Na co dzień rozwija projekt w branży tech travel, który pomaga klientom w ponad 50 krajach realizować swoje podróżnicze marzenia. W swojej pracy przeprowadza zarówno testy manualne jak i automatyzuje przypadki testowe przy użyciu takich frameworków jak Playwright czy Cypress, pisząc testy w JavaScriptcie / TypeScriptcie w zależności od potrzeb. Preferuje jednak język TypeScript. Jako lider techniczny stara się być mentorem dla mniej doświadczonych kolegów. Częsty gość podcastu technicznego pt. „Pieprzenie o kodzeniu”, gdzie wraz z zaproszonymi gośćmi opowiada z pasją o testach E2E i nie tylko. Był prelegentem na takich konferencjach jak Test Warez, 4Developers, test:fest, Na Podbój IT, Automatyzacja Testowania w praktyce, Tester Summit czy QA Summit.",
    "id" : 16,
    "linkedin" : "https://www.linkedin.com/in/ajelonek"
  }, {
    "photoUrl" : "https://2024.boilingfrogs.pl/wp-content/uploads/2024/01/szydlo-300x300-1.jpg",
    "twitter" : "https://twitter.com/lszydlo",
    "occupation" : "Software Consultant/Architect/Trainer",
    "name" : "Łukasz Szydło",
    "description" : "Programista pasjonat, fan “Software Craftsmanship” i zwinnego podejścia do wytwarzania oprogramowania. Lubi proste rozwiązania skomplikowanych problemów. Na codzień zajmuje się tematami z zakresu architektury aplikacji biznesowych, Domain-Driven Design, Continuous Delivery, technologii Java oraz testowania automatycznego. Prywatnie mąż, ojciec piątki dzieci.",
    "id" : 17,
    "linkedin" : "https://www.linkedin.com/in/łukasz-szydło-14754024/"
  }, {
    "photoUrl" : "https://2024.boilingfrogs.pl/wp-content/uploads/2024/01/ola_kunysz.jpg",
    "twitter" : "https://twitter.com/OlaQnysz",
    "occupation" : "Programistka i założycielka Szkoły Testów",
    "name" : "Aleksandra Kunysz",
    "description" : "Ola Kunysz tworzy oprogramowanie od kilkunastu lat. Ma doświadczenie w programowaniu full stack, testowaniu, zbieraniu wymagań i prowadzeniu szkoleń. Pracowała w korporacjach, startupach i pro bono w różnych branżach i krajach. Najbardziej lubi pisać kod, który ma znaczenie i rozwiązywać prawdziwe problemy. Od 2019 roku prowadzi Szkołę Testów i zwiększa świadomość w temacie jakości wśród programistów. Kiedy jest offline, jeździ na jednośladach, spaceruje z psem albo ćwiczy jogę.",
    "id" : 18,
    "linkedin" : "https://www.linkedin.com/in/akunysz"
  }, {
    "photoUrl" : "https://2024.boilingfrogs.pl/wp-content/uploads/2024/01/dpokusa.jpg",
    "twitter" : "",
    "occupation" : "Architekt Oprogramowania",
    "name" : "Daniel Pokusa",
    "description" : "Architekt oprogramowania, programista, a czasami nawet delivery manager z ponad 13 letnim doświadczeniem w branży IT ściśle związany z rodziną języków JVM. Na co dzień pragmatyk i zapalony zwolennik automatyzacji i efektywności, a równolegle trener i konsultant w zakresie systemów rozproszonych, jakości, organizacji zespołu i rekrutacji technicznej. Po godzinach tata i miłośnik kawy alternatywnej oraz nałogowy mówca konferencyjny na takich wydarzeniach jak 4Developers, BoilingFrogs, Confitura, Devoxx, Geecon, JDD, QualityExcites, czy Testwarez. Wierzy, że istotą wytwarzania dobrego oprogramowania jest komunikacja, współpraca i umiejętność dzielenia się wiedzą.",
    "id" : 19,
    "linkedin" : "https://www.linkedin.com/in/daniel-pokusa/"
  }, {
    "photoUrl" : "https://2024.boilingfrogs.pl/wp-content/uploads/2024/01/gil-300x300-1.jpeg",
    "twitter" : "https://twitter.com/mariuszgil",
    "occupation" : "Software Architect",
    "name" : "Mariusz Gil",
    "description" : "Software architect interesujący się złożonymi systemami o wysokiej wartości biznesowej, związany głównie z platformami webowymi. Ex-CTO, konsultant, speaker i trener w Bottega IT Minds. Z branżą IT związany od ponad 18 lat. Od kilku lat wykorzystuje EventStorming jako narzędzie do komunikacji pomiędzy zespołami developerskimi i biznesowymi, a także do modelowania oprogramowania w oparciu o DDD, CQRS czy EventSourcing. Uczestnik EventStorming Summit 2017, gdzie wspólnie z innymi zaproszonymi przez Alberto Brandoliniego osobami pracował nad rozwojem tej techniki. Po godzinach oddaje się swoim innym pasjom, fotografii i gitarze elektrycznej.",
    "id" : 20,
    "linkedin" : "https://www.linkedin.com/in/mariuszgil/"
  }, {
    "photoUrl" : "https://2024.boilingfrogs.pl/wp-content/uploads/2024/01/MichalBartyzel2-1024x683-1-2.jpg",
    "twitter" : "",
    "occupation" : "Software Developer, Consultant",
    "name" : "Michał Bartyzel",
    "description" : "Pracuję w branży IT od 20 lat jako programista, team leader, architekt, przedsiębiorca. Przez wiele lat pomagałem zespołom refaktoryzować kod, od jakiegoś czasu zajmuję się reorganizacją procesów dostarczania oprogramowania oraz usprawnianiem współpracy z klientem. Napisałem kilka książek min. “Oprogramowanie szyte na miarę. Jak rozmawiać z klientem, który nie wie, czego chce?” i “Getting Things Programmed. Droga do efektywności”. Więcej o mnie i o mojej pracy dowiesz się na stronie http://michalbartyzel.pl",
    "id" : 21,
    "linkedin" : "https://www.linkedin.com/in/mbartyzel"
  }, {
    "photoUrl" : "https://2024.boilingfrogs.pl/wp-content/uploads/2024/01/pprzybyl.jpg",
    "twitter" : "https://twitter.com/piotrprz",
    "occupation" : "Senior Developer Advocate @Elastic",
    "name" : "Piotr Przybył",
    "description" : "Notoryczny inżynier w pracy i poza nią, podążający za meandrami sztuki programowania. Java Champion. Testcontainers Champion. Oracle ACE. Zawodowo Remote Software Gardener, od kilkunastu lat wyrywający chwasty w ogródkach webowych. Zwykle przycinający Javę (od wersji 1.3), Scalę i Go do kształtów pożądanych przez klientów, ale i inne języki nie są mu obce. Miłośnik lekkości i zwinności, która powinna przejawiać się przede wszystkim w stosowaniu właściwych narzędzi. Programista, trener, prelegent. W swoich wystąpieniach mówi nie tylko o czystej Javie, ale także o architekturze oprogramowania, bezpieczeństwie komputerowym i umiejętnościach miękkich.",
    "id" : 22,
    "linkedin" : "https://www.linkedin.com/in/piotrprzybyl/"
  }, {
    "photoUrl" : "https://2024.boilingfrogs.pl/wp-content/uploads/2024/01/pstapp.jpg",
    "twitter" : "https://twitter.com/ptrstpp950",
    "occupation" : "Technology Advisor, Microsoft MVP",
    "name" : "Piotr Stapp",
    "description" : "Programista, inżynier, rzemieślnik, projektant oraz ojciec bliźniaków. Wierzy w ludzi, a nie w papiery – jest wyznawcą DevOps i wszelkiej automatyzacji. Jednym zdaniem: “Don’t Stapp me now”",
    "id" : 23,
    "linkedin" : "https://www.linkedin.com/in/piotrstapp/"
  }, {
    "name" : "Andrzej Konarski i Patryk Roguszewski",
    "description" : "Andrzej - Senior Software Engineer w Just Join IT, Interesujący się Domain Driven Design, CQRS, Architekturą Oprogramowania. W życiu zawodowym kierujący się maksymą, 'Rób to co kochasz, a nie przepracujesz, ani jednego dnia w życia'. Osoba nie umiejąca w sociale i blogowanie, Ze światkiem IT związany od 2013 roku, gdzie zaczynałem jako Backend Developer w PHP, a obecnie związany z technologią NodeJS. Ex Tech Lead, Przyszły tata, a w wolnym czasie oddaje się swoim zainteresowaniom, nurkowaniem i wędkarstwem. \n\n Patryk - autor bloga http://the-worst.dev/",
    "occupation": "Senior Software Engineer i Full Stack Engineer w Just Join IT",
    "photoUrl": "https://2024.boilingfrogs.pl/wp-content/uploads/2024/01/images.png",
    "id" : 24
  }, {
    "photoUrl" : "https://2024.boilingfrogs.pl/wp-content/uploads/2024/01/pstawirej.jpg",
    "twitter" : "https://twitter.com/p_stawirej",
    "occupation" : "Software Engineer, Trainer",
    "name" : "Piotr Stawirej",
    "description" : "Piotr Stawirej – jeśli go jeszcze nie poznałeś, to znaczy, że nie wiesz, jak wygląda prawdziwy fanatyk czystego kodu, ogarnięty obsesją TDD, piewca metod zwinnych w prowadzeniu projektów IT, wierny przekonaniu, że jedynie profesjonalne podejście do każdego aspektu życia jest drogą do sukcesu. W ciągu swojej ponad  16-letniej przygody z firmami z obszaru tworzenia map, nawigacji oraz systemów transakcyjnych (TeleAtlas, TomTom), oraz narzędzi do szkoleń zdalnych (Pragmatic Brains) Piotr stał się mentorem dla wielu młodszych kolegów i ekspertem domenowym. Równolegle, od 2018 roku Piotr prowadzi szkolenia jako trener firmy Bottega IT Minds. W pracy programisty stawia przede wszystkim na czysty design bez względu na język programowania czy użytą technologię. Jest przeciwnikiem cultu cargo w każdym jego przejawie. Od swoich współpracowników wymaga dużo, od siebie jeszcze więcej. Zaraża innych swoją pasją, profesjonalizmem i wyszukanym poczuciem humoru. W wolnym czasie możesz go spotkać na koncercie metalowym – próżno jednak szukać Piotra wśród publiki. Wypatruj go raczej zasiadającego za perkusją, gdzie podobnie jak w zespołach, z którymi pracuje, wybija rytm i nadaje tempo, tworząc jednocześnie przestrzeń dla innych.",
    "id" : 25,
    "linkedin" : "https://pl.linkedin.com/in/piotr-stawirej-6475127"
  }, {
    "photoUrl" : "https://2024.boilingfrogs.pl/wp-content/uploads/2024/01/tdubikowski-kwadrat-small.jpg",
    "twitter" : "",
    "occupation" : "Engineering SVP and Head of Wroclaw Site at Sportradar",
    "name" : "Tomasz Dubikowski",
    "description" : "Tomek is Engineering SVP and Head of Wroclaw Site at Sportradar, a Public Speaker and Trainer. He has over 10 years of professional experience working as a Software Engineer, Leader and Manager. As an engineer, he is passionate about craftsmanship, propagating clean code, automated tests, behaviour driven development and domain driven design. As a leader, he helps to build an organisational culture based upon autonomy, collaboration and trust so that developers are equipped with both the hard and soft skills necessary to build truly awesome products. Tomek loves to change the reality around him. He his highly pragmatic, challenges orthodoxy at all levels and believes that there is always room for improvement. He is always eager to discuss and share his ideas.",
    "id" : 26,
    "linkedin" : "https://www.linkedin.com/in/tomasz-dubikowski/"
  }, {
    "photoUrl" : "https://2024.boilingfrogs.pl/wp-content/uploads/2024/01/kkreft.jpeg",
    "twitter" : "",
    "occupation" : "Technical Lead at Volt.io",
    "name" : "Karol Kreft",
    "description" : "Programista o humanistycznych zainteresowaniach, fan NBA, wielbiciel dobrej architektury (nie tylko tej w kodzie) oraz wycieczek po górach. Zawodowo od ponad 10 lat związany z tworzeniem aplikacji w języku PHP. Pracuje w Volt jako Tech Lead gdzie wspiera zespoły programistyczne w dostarczaniu testowalnego, skalowalnego i bezpiecznego kodu zgodnie ze sprawdzonymi praktykami inżynierii oprogramowania.",
    "id" : 27,
    "linkedin" : "https://www.linkedin.com/in/karolkreft/"
  }, {
    "photoUrl" : "https://2024.boilingfrogs.pl/wp-content/uploads/2024/01/mostruszka.jpeg",
    "twitter" : "https://twitter.com/mostruszka",
    "occupation" : "Software engineer, tech lead",
    "name" : "Michał Ostruszka",
    "description" : "Doświadczony pathsoftware engineer i tech lead, póki co głównie w obszarach JVMowych i w tzw. “love-hate relationship” z systemami rozproszonymi. Cenię sobie pragmatyczne podejście zarówno do architektury, kodu jak i prowadzenia zespołów i projektów. Fan event-sourcingu i DDD ale tylko tam gdzie ma to sens. Na codzień introwertyk, od czasu do czasu występujący i rozmawiający z ludźmi na konferencjach technicznych.",
    "id" : 28,
    "linkedin" : "https://www.linkedin.com/in/michalostruszka/"
  } ],
  "speeches" : [ {
    "path" : 1,
    "speechSlotId" : 1,
    "description" : "Wstępniak",
    "speakerId" : 102,
    "id" : 102,
    "title" : "Boiling Frogs: Nieopowiedziane historie"
  },{
    "path" : 1,
    "speechSlotId" : 2,
    "description" : "Forget about the spine-chilling tales of managing large–scale systems. It doesn’t have to be a daunting task. We’re here to advocate for battle’s proven simplicity with a pinch of fun. We’ll slice through the Gordian knot of complexity, juggle scalability patterns while uncovering their dark sides, and turn time modelling into a time-travel adventure. No sale of silver bullets here; instead, we arm you with practical solutions and actionable strategies based on real-world examples and the dark sides of rapid-scaling problems. Join us to transform your approach to evolving system architecture, leaving you with insights immediately applicable to your work. https://www.linkedin.com/in/wojtekptak/ https://www.linkedin.com/in/andrzejgrzesik/",
    "speakerId" : 1,
    "id" : 1,
    "title" : "Architecture Uncomplicated: tools for simplified large scale systems"
  }, {
    "path" : 2,
    "speechSlotId" : 2,
    "description" : "Myślenie o myśleniu jest istotne, ale niedoceniane w naszej pracy. I w odróżnieniu od kodu – myślenia nie widać, a jego rezultaty nie uwidaczniają włożonego wysiłku. Niestety, bardzo łatwo pominąć istotne elementy, które wysypią nasze projekty w najmniej spodziewanym momencie. W końcu 15 minut planowania może zaoszczędzić tydzień kodowania – tylko kto ma na to czas? 🙂 W tej prezentacji zobaczysz jak nie wpaść w pułapki myślenia i podejmować lepsze decyzje. Dowiesz się: – Jak i kiedy zadawać właściwe pytania? – Jak analizować decyzje, szanse oraz zagrożenia? – Jak poznać problem, zanim odlecisz w rozwiązania? – Kiedy myśleć, a kiedy działać? – Jak podejmować właściwe decyzje? I wiele więcej!",
    "speakerId" : 3,
    "id" : 2,
    "title" : "Najpierw pomyśl, potem zrób – jak mądrze podejmować decyzje"
  }, {
    "path" : 3,
    "speechSlotId" : 2,
    "description" : "DDD na frontendzie to z pewnością kolejny buzzword w świecie frontendu. Czy rzeczywiście DDD ma w ogóle sens jeśli chodzi o tworzenie frontendu? Czy możemy przenieść podstawowe koncepcje DDD z backendu na frontend? Czas odpowiedzieć na to pytanie w sposób pragmatyczny i jasno powiedzieć co ma sens, a co zupełnie jeśli chodzi o DDD nie pasuje do frontendu.",
    "speakerId" : 4,
    "id" : 3,
    "title" : "DDD na frontendzie? A komu to potrzebne?"
  }, {
    "path" : 1,
    "speechSlotId" : 3,
    "description" : "Często programowanie kojarzy nam się głównie z pisaniem kodu, projektowanie – z rysowaniem wysoko poziomowych diagramów a przygotowywanie przypadków testowych ze żmudnym pisaniem scenariuszy. Zapominamy jednak, że wszystkie te czynności poprzedza analiza problemu oraz rozwiązania a wszelkie artefakty, które powstają, są de facto jej rezultatem – reprezentacją wiedzy. Mówi się, że “kod jest jedynie efektem ubocznym procesu myślowego”. Skoro analiza ma tak duży wpływ na każdy element inżynierii oprogramowania to czemu poświęcamy jej tak mało uwagi? Czy posiadanie w zespole analityka zwalnia nas z analitycznego myślenia? Czy w dobie rozwijającego się AI osoby bez umiejętności analitycznych będą w przyszłości w ogóle potrzebne? Na prelekcji przedstawię odpowiedzi na powyższe pytania oraz postaram się przekonać uczestników, że programista to nie “koder/crudowiec”, tester to nie “klikacz” a architekt to ktoś więcej niż osoba rysująca strzałki i prostokąty w Visio siedząc na wieży z kości słoniowej. Omówimy umiejętności analityczne, które powinien posiadać każdy członek zespołu programistycznego oraz techniki analityczne, które wspomagają proces analizy na każdym etapie inżynierii. Opowiemy też sobie, co to znaczy dobra analiza i co się dzieje, kiedy jej zabraknie. Prelekcja ma za zadanie zwiększyć świadomość na temat wagi analizy i umiejętności analitycznych w codziennej pracy oraz zachęcić uczestników do rozwoju kompetencji w tym obszarze.",
    "speakerId" : 5,
    "id" : 4,
    "title" : "A good craftsman is a good analyst"
  }, {
    "path" : 2,
    "speechSlotId" : 3,
    "description" : "W bezkresie narzędzi i frameworków których musimy się uczyć jako programiści zdarza nam się zapomnieć o fundamentach. Jednym z nich jest powoli zapominana sztuka programowania obiektowego. Na nowo odkryjemy kanony jej piękna. Razem przypomnimy sobie zasady, którymi warto się kierować aby nie popełniać programistycznego faux pas. Nie będziemy ich cytować niczym na rozmowie rekrutacyjnej. Zamiast tego skupimy się na konkretnych przykładach.",
    "speakerId" : 6,
    "id" : 5,
    "title" : "Zapomniana sztuka programowania obiektowego"
  }, {
    "path" : 3,
    "speechSlotId" : 3,
    "description" : "Mechanizm strumieniowania wiadomości nierzadko stanowi nieodzowny element infrastruktury w systemach rozproszonych. Od klasycznej integracji za pomocą zdarzeń (event-driven architecture) w architekturze mikroserwisowej, po zaawansowane systemy tradingowe typu HFT oparte na podejściu low latency — niezawodna (i możliwie szybka) komunikacja pomiędzy niezależnymi aplikacjami ma krytyczne znaczenie dla poprawnego działania systemu. Jak wygląda message streaming od podstaw? Z jakimi wyzwaniami musi zmierzyć się inżynier oprogramowania rozwijający takie narzędzie? Skąd bierze się przepustowość rzędu milionów wiadomości na sekundę? Jak duży wpływ może mieć kernel Linuxa na wydajność takiego rozwiązania? Chciałbym podzielić się swoim doświadczeniem, gdzie po kilku latach pracy w sektorze “tradingowym”, zdecydowałem się na dogłębne poznanie mechanizmu strumieniowania komunikatów właśnie poprzez rozwój własnego “message streamingu” od zera. Iggy.rs — projekt, który oryginalnie miał posłużyć do nauki języka programowania w Rust, z czasem trafił na listę GitHub Trending, zyskał kilkunastu stałych kontrybutorów, posiada całkiem pokaźny ekosystem i powoli zyskuje coraz większą popularność. To dzięki pracy nad nim, zrozumiałem m.in. dlaczego projektanci takich narzędzi jak choćby Kafka podjęli takie, a nie inne decyzje i jak duże znaczenie na stabilność, niezawodność oraz wydajność ma faktyczne zrozumienie mechanizmów synchronizacji danych, I/O, oraz niskopoziomowych API na poziomie konkretnego systemu operacyjnego.",
    "speakerId" : 7,
    "id" : 6,
    "title" : "Zbudujmy własną Kafkę, czyli strumieniowanie wiadomości od kuchni"
  }, {
    "path" : 1,
    "speechSlotId" : 4,
    "description" : "Powszechnie znaną prawdą jest, iż niewielu z nas przejmuję się wydajnością naszego kodu, jeszcze mniej z nas miało do czynienia z testami wydajnościowymi. Wśród tych z nas, którzy toczą nierówną walkę z wydajnością, wąska garstka z nas jest świadoma jak wiele kryję się w nich kłamstw, niedomówień i fałszywych obietnic. Podczas prezentacji poznamy antywzorce w testowaniu wydajności oraz kilka sprawdzonych w boju praktycznych rad jak nie dać się omamić wynikom testów. Czy powinniśmy się obawiać „coordinated ommision”? Dlaczego statystyka to najwyższa forma kłamstwa, czyli szybki kurs czytania wyników testów. Dlaczego „latency” i „throughput” to nie to samo? Dlaczego dane wejściowe są równie ważne jak scenariusze testowe? Na jakie pytania odpowiadają microbenchmarki? Czy testy wydajnościowe mają warstwy? Dlaczego w testach wydajnościowych nie chodzi o liczby? To tylko wybrane zagadnienia, o których opowiem. Jeśli nie interesują Cię testy wydajnościowe i unikasz tego tematu jak zarazy, na tej prezentacji dowiesz się dlaczego tak jest. Jeśli jednak czujesz się wyznawcą maszyny i tematy wydajności nie są Ci obce, pomogę Ci z większą świadomością projektować testy i interpretować ich wyniki.",
    "speakerId" : 8,
    "id" : 7,
    "title" : "Testy wydajnościowe i inne kłamstwa"
  },{
    "path" : 1,
    "speechSlotId" : 7,
    "description" : "Skąd wiesz czy piszesz dobry kod?! Bo jest zgodny z konwencjami? Bo statyczna analiza nie wykrywa błędów? Bo przestrzega SOLID, CUPID, DRY, KISS? Wszystkie te kryteria są niesamowicie subiektywne, bo czy zgadzamy się wszyscy czym jest pojedyncza odpowiedzialność, albo ile linii ma krótką metoda, czy dana klasa wystarczająco enkapsuluje? I tu pojawia się pytanie, czy da się obiektywnie oceniać kod? W 100% raczej nie, ale da się dużo bardziej niż do tej pory.",
    "speakerId" : 17,
    "id" : 16,
    "title" : "Czysty kod - to jednak nie takie proste"
  },  {
    "path" : 2,
    "speechSlotId" : 7,
    "description" : "Od lat 70-tych przejawia się w świadomości programistów na całym świecie. Niby nieuchwytne, mówi, że “Any organization that designs a system (defined broadly) will produce a design whose structure is a copy of the organization’s communication structure.” Co kilka lat wypływa w ten lub inny sposób, ostatnio przy okazji książki Team Topologies. Wydaje się, że zostanie z nami na zawsze. Tylko jak to przełożyć na codzienną pracę inżyniera? W ramach tej prezentacji postaram się odpowiedzieć na to pytanie, odnosząc się do własnych doświadczeń w pracy z zespołami programistów, odwołując się do rozmaitych źródeł książkowych i internetowych, a także promując jedną główną ideę, którą spłycić można do: “pracuj nie tylko nad API swojego kodu, ale też API komunikacji Twojego zespołu z pozostałymi zespołami”. Co to dokładnie znaczy? Po to powstał ten wykład. A jako bonus, zobaczymy, jak to może się odzwierciedlić w kodzie i przełożyć na kod legacy.",
    "speakerId" : 9,
    "id" : 81,
    "title" : "Prawo Conwaya w akcji"
  },{
    "path" : 2,
    "speechSlotId" : 4,
    "description" : "Badania pokazują, że nasza kraina mlekiem i miodem płynąca wcale nie jest takim Eldorado jak obiecują organizatorzy bootcampów. Wypalenie jest demokratycznie – płeć, wiek, ilość doświadczenia nie mają dla niego znaczenia (chociaż wypalamy się w inny sposób). Podczas tej prezentacji skupię się na analizie czynników związanych z pracą, które mają istotny wpływ na poziom wypalenia wśród pracowników IT. Prezentacja przedstawi konkretne zagrożenia związane z obciążeniem pracą, długimi godzinami pracy i dojazdów, jednocześnie proponując strategie i praktyki, które mogą przeciwdziałać wypaleniu i promować zdrowie psychiczne w miejscu pracy. Wsparcie teoretyczne prezentacji oparte jest na najnowszych badaniach naukowych, literaturze specjalistycznej oraz praktykach rekomendowanych przez ekspertów w dziedzinie zdrowia psychicznego. Ale podzielę się też historią swojego wypalenia i strategiami, które działają u moich podopiecznych. Ola Kunysz jest programistką, mentorką i autorką treści edukacyjnych. Z branżą IT jest związana od kilkunastu lat. Doświadczenie zdobywała w Polsce i Stanach Zjednoczonych. Pracowała w wielu międzynarodowych projektach ― od telekomunikacji, przez fin-tech, po e-commerce. W 2018 roku zmagała się z wypaleniem zawodowym, rok później założyła Szkołę Testów, a w 2021 roku opublikowała książkę Kierunek Jakość. Kiedy jest offline, jeździ na jednośladach, chodzi po górach albo ćwiczy jogę.",
    "speakerId" : 18,
    "id" : 17,
    "title" : "Czy można pracować inaczej? Prosta droga branży IT do wypalenia"
  }, {
    "path" : 3,
    "speechSlotId" : 4,
    "description" : "Pesymistyczne blokowanie rekordów było bezpiecznie i proste, ale niezbyt wydajne. Czy blokowanie optymistyczne jest odpowiedzią? A jeśli jest, to czy na pewno implementujemy je w taki sposób, żeby spełniało swoje założenia? Czy ORM-y odrabiają za nas pracę domową, czy tylko dają nam narzędzia? Nieco więcej o tym protokole w aplikacjach z interfejsem REST, a może nie tylko.",
    "speakerId" : 10,
    "id" : 99,
    "title" : "Zbyt optymistyczne lockowanie"
  }, {
    "path" : 1,
    "speechSlotId" : 5,
    "description" : "Narzędzia AI zajmują dziś ważne miejsce w pracy programisty, a ChatGPT wciąż jest najpopularniejszym z nich. Mimo że korzystanie z niego jest banalnie proste, to dopiero znajomość mocnych stron i świadomość ograniczeń otwiera drogę do poprawy efektywności pracy. Podczas tej krótkiej prezentacji podzielę się swoimi praktykami i sposobami, które pozwalają zwiększyć efektywność pracy z kodem. ",
    "speakerId" : 11,
    "id" : 10,
    "title" : "Dłuto programisty, czyli efektywna praca z kodem przy użyciu ChatGPT"
  }, {
    "path" : 2,
    "speechSlotId" : 5,
    "description" : "Opowiem wam o tym, jak HR może pomóc programistom w rozwoju kariery. Dowiecie się, jakie narzędzia i strategie są kluczowe w procesie przechodzenia od ‘Hello World‘ do ‘Hello Career‘. Gotowi na tę fascynującą podróż? W dzisiejszym dynamicznym środowisku IT, rozwijanie kariery programistów staje się coraz ważniejsze. HR ma kluczową rolę w wspieraniu i kształtowaniu rozwoju zawodowego programistów.",
    "speakerId" : 12,
    "id" : 11,
    "title" : "Kodowanie rozwoju: Od 'Hello World' do 'Hello Career'"
  }, {
    "path" : 3,
    "speechSlotId" : 5,
    "description" : "Doświadczenie Dewelopera (ang. Developer Experience) to termin rzadko spotykany, w większości firm jeszcze nieznany. W tej prezentacji chciałbym przybliżyć to zagadnienie, pokazać jak to może wyglądać w teorii i jak to rozwiązujemy praktycznie w firmie gdzie pracuję. Mam nadzieję, że po tej prezentacji wyjdziesz z wiedzą i motywacją, by zadbać o doświadczenie swoje i innych deweloperów.  ",
    "speakerId" : 13,
    "id" : 12,
    "title" : "Developer Experience w kwadrans"
  }, {
    "path" : 1,
    "speechSlotId" : 6,
    "description" : "Opowiem Wam o liderach, o tym w jakie pułapki najczęściej wpadają, z jakimi najczęściej trudnościami i błędami mierzą się chcąc sprostać swojej roli. Pracuję z liderami od kilku lat, przeprowadziłam wiele szkoleń liderskich. Łącznie to około 3000 osób, które piastują stanowiska liderskie albo pretendują do tej roli. O błędach liderów powiedziano już wiele. Moja perspektywa, to perspektywa trenera, który spotyka liderów, kierowników, menedżerów z różnym poziomem doświadczenia, słucha ich historii, trudności, bolączek i wspiera ich w zakresie kompetencji miękkich. To także perspektywa psychologa, który dostrzega mechanizmy, jakie się za tymi trudnościami kryją. Podzielę się z Wami moimi osobistymi spostrzeżeniami. Kto wie, może dzięki nim Wy, stając się liderami, popełnicie mniej błędów w przyszłości.",
    "speakerId" : 14,
    "id" : 13,
    "title" : "Subiektywnie o liderach w IT"
  }, {
    "path" : 2,
    "speechSlotId" : 6,
    "description" : "Pracujemy na globalnym rynku. Wielokulturowosc to nasza codziennosc. Zastanowimy sie, jak przeanalizowac roznice kulturowe na podstawie badan naukowych. Porozmawiamy o Do and Don't. Przyjrzymy sie tez postrzeganiu Polski przez inne kultury.",
    "speakerId" : 15,
    "id" : 14,
    "title" : "Jak poruszac sie w miedzynarodowym projekcie"
  }, {
    "path" : 3,
    "speechSlotId" : 6,
    "description" : "Playwright to obecnie jedna z najbardziej perspektywicznych technologii do automatyzacji testów aplikacji webowych w świecie JS/TS i nie tylko. Dzięki niemu możemy pisać testy E2E, testy integracyjne z wykorzystaniem mocków czy też nawet automatyzować testowanie naszego API (aby życie było prostsze!). Czy w 2024 roku wejdzie on z drzwiami do domu polskich bojowników o jakość? Czy wygra on bitwę z bardziej doświadczonymi rywalami jakimi są Jest, Cypress, WebdriverIO czy Selenium? Podczas wystąpienia porównam go do innych narzędzi tego typu, pokaże wady i zalety każdego z nich oraz postaram się przekazać to w taki sposób, żeby zarówno mniej doświadczeni uczestnicy jak i Ci bardziej zaawansowani mogli zrozumieć przedstawiany temat. Opowiem również o nowościach w Playwrightcie jakie przyniosły nam ostatnie wersje oraz porównam je do featurów dostarczanych przez inne frameworki tego typu. See you soon!",
    "speakerId" : 16,
    "id" : 15,
    "title" : "Czy Playwright zdominuje testy automatyczne aplikacji webowych w 2024 roku?"
  }, {
    "path" : 3,
    "speechSlotId" : 7,
    "description" : "Aplikacje CLI (Command–line interface) są z nami od połowy lat sześćdziesiątych. Zapewne znasz ich przynajmniej kilka, a może nawet miałeś okazję z nich korzystać. Istnieje całkiem duże prawdopodobieństwo, że w najbliższym czasie będziesz zmuszony zaprzyjaźnić się z nimi w mniejszym lub większym stopniu niezależnie od Twojej woli- aktualne trendy gdy się im bliżej przyjrzeć jasno wskazują na coraz szersze i popularniejsze zastosowanie aplikacji obsługiwanych z linii komend. Wystarczy wspomnieć narzędzia dostarczone przez dostawców chmur publicznych jak Azure CLI, AWS CLI, gcloud CLI, gsutil, narzędzia do budowania aplikacji jak Quarkus CLI, Angular CLI, czy nawet takie klasyki jak git, czy docker. Trend ten trwający już kilka dobrych lat nie słabnie, wręcz przeciwnie i warto wiedzieć czy i kiedy rozważyć zbudowanie aplikacji CLI, jak taka aplikacja jest zbudowana, jak zadbać o jej jakość i jakie są dobre praktyki pozwalające na stworzenie wartościowych i dobrze wykonanych programów obsługiwanych z linii komend- zarówno od strony użyteczności jak i architektury samego rozwiązania. Na te i wiele więcej pytań odpowiem w trakcie prezentacji.",
    "speakerId" : 19,
    "id" : 181,
    "title" : "Raise of CLI applications"
  }, {
    "path" : 1,
    "speechSlotId" : 8,
    "description" : "DDD i jego pozytywy odmieniono już w prezentacjach chyba na wszystkie możliwe przypadki. „Wdrażanie” DDD często może być marszem ku klęsce, bo rzeczywistość nie jest już tak różowa jak na slajdach… Nie mówmy więc kolejny raz o roli i znaczeniu agregatów czy bounded-contextów, ale na konkretnych przykładach pokażmy, jakie pułapki tu czekają i jak można je skutecznie ominąć, aby uniknąć tytułowej porażki i kolejnych szram z Wietnamu.",
    "speakerId" : 20,
    "id" : 19,
    "title" : "Domain Driven Disaster"
  }, {
    "path" : 2,
    "speechSlotId" : 8,
    "description" : "Niektórym inżynierom/-kom w pewnym momencie przychodzi do głowy, że są traktowani jako podwykonawcy biznesu. Jeśli jest to klient wewnętrzny to inżynier jest dla biznes po prostu dostawca, a jeśli są w jednej organizacji, to IT jest dla biznesu wewnętrznym podwykonem. Tyle, że Ci inżynierowie/-ki chcą być dla klienta partnerem, nie podwykonem i nie wiedzą jak to zrobić. Jeśli to, co wyżej napisałem w jakiś sposób odzwierciedla Twoje wewnętrzne przemyślenia, wpadnij na moją prezkę. Podam Ci kilka punktów, na które warto zwrócić uwagę, jeśli chcesz budować partnerską relację z biznesem.",
    "speakerId" : 21,
    "id" : 20,
    "title" : "Szybki kurs myślenia biznesowego dla inżynierów i inżynierek"
  }, {
    "path" : 3,
    "speechSlotId" : 8,
    "description" : "Każda i każdy z nas wie, co to jest piramida testów i dlaczego słuszna jest. Wszyscy też wiemy, jak wygląda porządnie zbudowana piramida. Może nie byliśmy w Egipcie, Mezoameryce albo Iraku czy Iranie, ale przynajmniej widzieliśmy zdjęcia i wiemy: tak należy budować, jak ktoś chce mieć solidny kawał budynku na lata!!!11jeden. Tylko czy dziś też postawisz sobie zgrabną piramidkę na działce, bądź jako domek jednorodzinny, bądź jako centrum handlowe? Może chociaż garaż? Niekoniecznie? O, a dlaczego? 😉 No właśnie… Piramidy stawiane w starożytności odpowiadały potrzebom ludzi z tamtych czasów (także religijnym). Dziś nasze potrzeby, materiały i możliwości są już zupełnie inne. I o ile możemy cały czas (z technicznego punktu widzenia) walnąć sobie zgrabną piramidkę, to jakość życia po zamieszkaniu w takim czymś będzie co najwyżej średnia (i jak w to ogóle ocieplić???) A co jeśli podobnie jest z piramidą testów? Co jeśli powstała w czasach, gdy systemy wyglądały zupełnie inaczej, gdy system przez nią pokrywany potrzebował sprzętu, który nie zmieściłby się w Twoim mieszkaniu? Co jeśli mieliśmy wtedy inne zespoły, komunikujące się faksem? Gdy nie było internetu, o mikrousługach nie wspominając? Co jeśli narzędzia i automatyzacja weszły na zupełnie inny poziom, z perspektywy starożytnych wręcz kosmiczny? Co jeśli starożytne receptury medyczne, wykute w pocie czoła na ścianach świątyń, dziś służą tylko za ciekawostkę, a nie zestaw ponadczasowych i niekwestionowanych prawd? Wpadnij na wspólne drapanie się po głowie (każdy swojej).",
    "speakerId" : 22,
    "id" : 21,
    "title" : "O piramidzie testów i jakości życia"
  }, {
    "path" : 1,
    "speechSlotId" : 9,
    "description" : "Pewnie pracujesz w jakimś “agile“. Może jest to “kanban”, może “scrum”, może “SAFe”, a może “Janueszeks-ogile”. Na 100% nie jest to waterfall, bo przecież waterfall to zło 🙂 Z drugiej strony (prawie) wszyscy narzekają na scrum masterów, na proces, retrospektywa się nie posuwa, a całość …. lepiej nie mówić. Ta prezentacja to zbiór obserwacji i lekcji, które ja z tego wyniosłem. Jak spojrzeć na proces trochę inaczej, na co szczególnie zwrócić uwagę i gdzie “lekko” nacisnąć. Szczególnie, że co może pójść nie tak? Na kolejnej retrospektywnie góra to omówimy 😉 Uwaga: jestem techniczny i patrzę z poziomu architekta i nigdy nie byłem scrum master. Będzie też ironicznie i może nie być miło 😉",
    "speakerId" : 23,
    "id" : 22,
    "title" : "Co poszło nie tak z agile i co Ty możesz z tym zrobić"
  }, {
    "path" : 2,
    "speechSlotId" : 9,
    "speakerId" : 24,
    "id" : 23,
    "title" : "Beyond Boundaries: Plusy i minusy Tech Agnostic w architekturze mikroserwisowej",
    "description": "Czy w firmie produktowej, gdzie nie istnieje rola CTO, dział IT należy do produktu, a na jego szczycie stoi nietechniczny Head Of Product. Core systemu zbudowany z technologicznego tornado w postaci miksu Ruby, Node, .Net, jest przepisem na sukces czy srogą porażką? Czy grupka osób z odmiennych środowisk, współpracująca ze sobą zgodnie z zasadami Team Topologies i cross streamowości może pełnić rolę Architekta i skutecznie rozwiązywać strategiczne problemy? Podczas wystąpienia, postaramy odpowiedzieć na te pytania, posługując się realnymi przykładami."
  }, {
    "path" : 3,
    "speechSlotId" : 9,
    "description" : "Podczas mojej kariery jako programista, trener i mentor, spotkałem wiele sytuacji, gdy moi współpracownicy lub ja sam napotkaliśmy na trudny do przetestowania kod. Niektóre z tych sytuacji się powtarzały, a niektóre z nich nie. Ta prezentacja jest kontynuacją poprzedniej części. Pokażę, jak można uprościć aplikację i umożliwić jej testowanie poprzez analizę napotkanych przypadków i zastosowanych rozwiązań. Przed dołączeniem do prezentacji zalecana jest wiedza na temat OOP, Onion/Hexagonal Architecture, języka Java (i JUnit) lub języka podobnego do Javy oraz doświadczenie w pisaniu testów jednostkowych, integracyjnych i end-to-end. Po prezentacji będziecie zaznajomieni z tematami: – Jak testować problematyczne klasy. – Jak testować aplikacje wielowątkowe. – Jak testować tolerancję na błędy (fault tolerance and resilience) – Dlaczego warto stosować Property Based Testing – Strategie testowania obiektów mutowalnych. – Czy potrzebuję testować logowanie? – Jak i dlaczego testować mutowalność i porównywanie obiektów.",
    "speakerId" : 25,
    "id" : 24,
    "title" : "Testing the untestable PART II – patterns, use cases and practices"
  }, {
    "path" : 1,
    "speechSlotId" : 10,
    "description" : "Mam wrażenie, że tworzenie oprogramowania stało się ostatnio dość nerwowym zajęciem. Teoretycznie wszystko jest jasne – mamy tysiące wzorców projektowych, dobre praktyki na wszystko, a w razie potrzeby zawsze istnieje biblioteka w JavaScripcie która robi to czego akurat potrzebujemy. Ba, jest też ChatGPT który przecież zakoduje wszystko za nas. No i ostatecznie, mamy też wspaniały management, który zawsze pomoże rozwiązać problemy, prawda? Czemu zatem mając to wszystko projekty nie pędzą do przodu, jakość nie wystrzeliła przez sufit, a dług techniczny ma się świetnie? Czerpiąc inspirację z pragmatyzmu (lub jego braku), w swojej prezentacji chciałbym podzielić się kilkoma przykładami z życia, jak łatwo zakopać się w bieżączce i zapomnieć co jest ważne. Spróbujemy też pomyśleć, gdzie rady rodem z Akademii Chłopskiego Rozumu mogłyby pomóc.",
    "speakerId" : 26,
    "id" : 25,
    "title" : "Pragmatism Rediscovered: podróż z powrotem do zdrowego rozsądku"
  }, {
    "path" : 2,
    "speechSlotId" : 10,
    "description" : "Bycie Liderem Technicznym to nie tylko większa odpowiedzialność ale i miejsce przy stole gdzie podejmuje się kluczowe decyzje, przede wszystkim te, związane z technologią. Taka sytuacja przypomina jednak bycie między młotem (biznesem) a kowadłem (zespołem developerskim). Podczas prezentacji zastanowimy się, czy w takich warunkach można odnaleźć się i dlaczego warto oraz jaka jest rola przywództwa w środowiskach zwinnych? Na końcu dotrzemy do miejsc najciemniejszych i zmierzymy się z największymi lękami związanymi z byciem liderem. Być może wspólnie uda nam się znaleźć na nie remedium.",
    "speakerId" : 27,
    "id" : 26,
    "title" : "Czego boi się Tech Lead?"
  }, {
    "path" : 3,
    "speechSlotId" : 10,
    "description" : "Awarie się zdarzają, wdrożenia nie idą zgodnie z planem, systemy produkcyjne przestają działać. Czy to błąd w kodzie (twoim, czy biblioteki z której korzystasz), czy awaria infrastruktury lub sprzętu, pierwszą rzeczą jest przywrócenie pracy systemu z minimalnymi stratami. Ale co dzieje się później? Czy powinniśmy po prostu wrócić do swoich zajęć? Słyszałeś o “Post Mortem Analysis”? Brzmi strasznie, ale tak naprawdę jest szalenie przydatna praktyka o ile użyta jest poprawnie. I o tym właśnie chciałbym opowiedzieć. Czym jest taka analiza, jak ją efektywnie przeprowadzić, kto powinien (a kto nie) wziąć w niej udział, na co uważać i do czego dążyć podczas tego procesu. W końcu chyba nie chcesz skończyć z taką samą awarią produkcji jutro, prawda?",
    "speakerId" : 28,
    "id" : 27,
    "title" : "Ugasiłeś pożar na produkcji, co dalej?"
  } ],
  "speechSlots" : [ {
    "timeLabel" : "9:10 - 9:30",
    "id" : 1
  }, {
    "timeLabel" : "9:50 - 10:35",
    "id" : 2
  }, {
    "timeLabel" : "10:55 - 11:40",
    "id" : 3
  }, {
    "timeLabel" : "12:00 - 12:45",
    "id" : 4
  }, {
    "timeLabel" : "12:50 - 13:05",
    "id" : 5
  }, {
    "timeLabel" : "14:00 - 14:15",
    "id" : 6
  }, {
    "timeLabel" : "14:20 - 15:05",
    "id" : 7
  }, {
    "timeLabel" : "15:25 - 16:10",
    "id" : 8
  }, {
    "timeLabel" : "16:30 - 17:15",
    "id" : 9
  }, {
    "timeLabel" : "17:35 - 18:20",
    "id" : 10
  } ]
}
